{"tid":1103956,"publishdate":"2004-05-26","title":"Sakshi vs Union Of India on 26 May, 2004","doc":"<h2 class=\"doc_title\">Sakshi vs Union Of India on 26 May, 2004</h2>\n\n<h3 class=\"doc_author\">Author: <a href=\"/search/?formInput=authorid:g-p-mathur\">G.P. Mathur</a></h3>\n\n<h3 class=\"doc_bench\">Bench: <a href=\"/search/?formInput=benchid:g-p-mathur\">G.P. Mathur</a></h3>\n\n<pre id=\"pre_1\">           CASE NO.:\nWrit Petition (crl.)  33 of 1997\n\nPETITIONER:\nSAKSHI\n\nRESPONDENT:\nUNION OF INDIA\n\nDATE OF JUDGMENT: 26/05/2004\n\nBENCH:\nRAJENDRA BABU CJ &amp; G.P. MATHUR\n\nJUDGMENT:</pre>\n<p data-structure=\"Issue\" id=\"p_1\">JUDGMENT\n\n2004 Supp(2) SCR 723\n\n\nThe Judgment of the Court was delivered by\n\nG.P. MATHUR, J. : 1. This writ petition under <a href=\"/doc/981147/\" id=\"a_1\">Article 32</a> of the\nConstitution has been filed by way of public interest litigation by Sakshi,\nwhich is an organisation to provide legal, medical, residential,\npsychological or any other help, assistance or charitable support for\nwomen, in particular those who are victims of any kind of sexual abuse\nand/or harassment, violence or any kind of atrocity or violation and is a\nviolence intervention centre. The respondents arrayed in the writ petition\nare (1) Union of India; (2) Ministry of Law and Justice; and (3)\nCommissioner of Police, New Delhi. The main reliefs claimed in the writ\npetition are as under :\n</p>\n<blockquote id=\"blockquote_1\">(A)    Issue a writ in the nature of a declaration or any other appropriate\nwrit or direction declaring inter alia that &quot;sexual intercourse&quot; as\ncontained in <a href=\"/doc/623254/\" id=\"a_2\">section 375</a> of the Indian Penal Code shall include all forms\nof penetration such as penile/vaginal penetration, penile/oral penetration,\npenile/anal penetration finger/vaginal and finger/anal penetration and\nobject/vaginal penetration;\n</blockquote>\n<blockquote id=\"blockquote_2\">(B)    Consequently, issue a writ, order or direction in the nature of a\ndirection to the respondents and its servants and agents to register ail\nsuch cases found to be truly on investigation, offences falling within the\nbroadened interpretation of &quot;sexual intercourse&quot; set out in prayer (A)\naforesaid as offences under <a href=\"/doc/623254/\" id=\"a_3\">Section 375</a>, <a href=\"/doc/1279834/\" id=\"a_4\">376</a> and <a href=\"/doc/668689/\" id=\"a_5\">376A</a> to <a href=\"/doc/9545/\" id=\"a_6\">376D</a> of the Indian\nPenal Code, 1860;\n</blockquote>\n<blockquote id=\"blockquote_3\">(C)    Issue such other writ, order or direction as this Hon&#x27;ble Court may\ndeem appropriate in the present facts and circumstances.\n</blockquote>\n<p data-structure=\"Issue\" id=\"p_2\">The petition is thus restricted to a declaratory relief and consequential\ndirections.\n</p>\n<p data-structure=\"Section\" id=\"p_3\">2. It is set out in the writ petition that the petitioner has noticed with\ngrowing concern the dramatic increase of violence, in particular sexual\nviolence against women and children as well as the implementation of the\nprovisions of <a href=\"/doc/1569253/\" id=\"a_7\">Indian Penal Code</a> namely <a href=\"/doc/1836974/\" id=\"a_8\">Sections 377</a>, <a href=\"/doc/623254/\" id=\"a_9\">375</a>/<a href=\"/doc/1279834/\" id=\"a_10\">376</a> and <a href=\"/doc/203036/\" id=\"a_11\">354</a> by the\nrespondent authorities. The existing trend of the respondent authorities\nhas been to treat sexual violence, other than penile/vaginal penetration,\nas lesser offences falling under either <a href=\"/doc/1836974/\" id=\"a_12\">Section 377</a> or 354 of the <a href=\"/doc/1569253/\" id=\"a_13\">IPC</a> and\nnot as a sexual offence under <a href=\"/doc/623254/\" id=\"a_14\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_15\">376</a> IPC. It has been found that\noffences such as sexual abuse of minor children and women by penetration\nother than penile/vaginal penetration, which would take any other form and\ncould also be through use of objects whose impact on the victims is in no\nmanner less than the trauma of penile/vaginal penetration as traditionally\nunderstood under <a href=\"/doc/623254/\" id=\"a_16\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_17\">376</a>, have been treated as offences falling\nunder <a href=\"/doc/203036/\" id=\"a_18\">Section 354</a> of the IPC as outraging the modesty of a women or under\n<a href=\"/doc/1836974/\" id=\"a_19\">Section 377</a> IPC as unnatural offences.\n</p>\n<p data-structure=\"PetArg\" id=\"p_4\">3. The petitioner through the present petition contends that the narrow\nunderstanding and application of rape under <a href=\"/doc/623254/\" id=\"a_20\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_21\">376</a> IPC only to the\ncases of penile/vaginal  penetration runs contrary to the existing\ncontemporary understanding of rape as an intent to humiliate, violate and\ndegrade a woman or child sexually and, therefore, adversely affects the\nsexual integrity and autonomy of women and children in violation of <a href=\"/doc/1199182/\" id=\"a_22\">Article\n21</a> of the Constitution.\n</p>\n<p data-structure=\"Section\" id=\"p_5\">4.  The petitioner submits that a plain reading of <a href=\"/doc/623254/\" id=\"a_23\">Section 375</a> would make\nit apparent that the term &quot;sexual intercourse&quot; has not been defined and is,\ntherefore, subject to and is capable of judicial interpretation. Further\nthe explanation to <a href=\"/doc/623254/\" id=\"a_24\">Section 375</a> IPC does not in any way limit the term\npenetration to mean penile/vaginal penetration. The definition of the term\nrape as contained in the Code is extremely wide and takes within its sweep\nvarious forms of sexual offenses. Limiting the understanding of &quot;rape&quot; to\nabuse by penile/vaginal penetration only, runs contrary to the contemporary\nunderstanding of sexual abuse law and denies majority of women and children\naccess to adequate redress in violation of <a href=\"/doc/367586/\" id=\"a_25\">Article 14</a> and <a href=\"/doc/1199182/\" id=\"a_26\">21</a> of the\nConstitution. Statistics and figures indicate that sexual abuse of\nchildren, particularly minor girl children by means and manner other than\npenile/ vaginal penetration is common and may take the form of penile/anal\npenetration, penile/oral penetration, finger/vaginal penetration or object/\nvaginal penetration. It is submitted that by treating such forms of abuse\nas offences falling under <a href=\"/doc/203036/\" id=\"a_27\">Section 354</a> IPC or 377 <a href=\"/doc/1569253/\" id=\"a_28\">IPC</a>, the very intent of\nthe amendment of <a href=\"/doc/1279834/\" id=\"a_29\">Section 376</a> IPC by incorporating sub-<a href=\"/doc/915147/\" id=\"a_30\">section 2(f)</a> therein\nis  defeated.  The  said  interpretation  is  also contrary to  the\ncontemporary understanding of sexual abuse and violence all over the world.\n</p>\n<p data-structure=\"PetArg\" id=\"p_6\">5.  The petitioner submits that there has for some time now been a growing\nbody of feminist legal theory and jurisprudence which has clearly\nestablished rape as an experience of humiliation, degradation and violation\nrather than an outdated notion of penile/vaginal penetration. Restricting\nan understanding of rape in terms sought to be done by the respondent\nauthorities and its agents reaffirms the view that rapists treat rape as\nsex and not violence and thereby condone such behaviour especially when it\ncomes to sexual abuse of children.\n</p>\n<p data-structure=\"Precedent\" id=\"p_7\">6. In this regard, reference is invited to the observations of a renowned\nexpert on the issue of sexual abuse :\n</p>\n<blockquote id=\"blockquote_4\">&quot;...... in rape ....... the intent is not merely to &quot;take&quot;, but to\nhumiliate and degrade.......Sexual assault in our day and age is hardly\nrestricted to forced genital copulation, nor is it exclusively a male-on-\nfemale offence. Tradition and biologic opportunity have rendered vaginal\nrape a particular political crime with a particular political history, but\nthe invasion may occur through the month or the rectum as well. And while\nthe penis may remain the rapist&#x27;s favourite weapon, his prime instrument of\nvengeance ..........it is not in fact his only tool. Sticks, bottles and\neven fingers are often substituted for the &quot;natural&quot; thing. And as men may\ninvade women through other orifices, so too, do they invade other men. Who\nis to say that the sexual humiliation suffered through forced oral or\nrectal penetration as a lesser violation of the personal, private inner\nspace, a lesser injury to mind, spirit and sense of self?&quot; (Susan\nBrownmiller, Against Our Will 1986).\n</blockquote>\n<p data-structure=\"Section\" id=\"p_8\">7. The petitioner further submits that the respondent authorities and their\nagents have failed to take into consideration the legislative purpose of\n<a href=\"/doc/1836974/\" id=\"a_31\">Section 377</a> IPC. Reference has also been made to The Law Commission of\nIndia Report (No. 42) of 1971 pp. 281. While considering whether or not to\nretain <a href=\"/doc/1836974/\" id=\"a_32\">Section 377</a> IPC, the Commission found as under :\n</p>\n<blockquote id=\"blockquote_5\">&quot;There are, however, a few sound reasons for retaining the existing law in\nIndia. First, it cannot be disputed that homosexual acts and tendencies on\nthe part of one spouse may affect the married life and happiness of the\nother spouse, and from this point of view, making the acts punishable by\nlaw has social justification. Secondly, even assuming that acts done in\nprivate with consent do not in themselves constitute a serious evil, there\nis a risk involved in repealing legislation which has been in force for a\nlong time........Ultimately, the answer to the question whether homosexual\nacts ought to be punished depends on the view one takes of the relationship\nof criminal law to morals.......We are inclined to think that Indian\nsociety, by and large, disapproves of homosexuality and this disapproval is\nstrong enough to justify it being treated as a criminal offence even where\nadults indulge in it in private.&quot;\n</blockquote>\n<p data-structure=\"Section\" id=\"p_9\">In view of the Commission&#x27;s conclusions regarding the purview of <a href=\"/doc/1836974/\" id=\"a_33\">Section\n377</a> IPC, the said section was clearly intended to punish certain forms of\nprivate sexual relations perceived as immoral. Despite the same, the\npetitioner submits, the respondent authorities have, without any\njustification, registered those cases of sexual violence which would\notherwise fall within the scope and ambit of <a href=\"/doc/623254/\" id=\"a_34\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_35\">376</a> IPC, as cases\nof moral turpitude under <a href=\"/doc/1836974/\" id=\"a_36\">Section 377</a> IPC. It is submitted that the\nrespondent authorities and their agents have wrongly strained the language\nof <a href=\"/doc/1836974/\" id=\"a_37\">Section 377</a> IPC intended to punish &quot;homosexual&quot; behaviour to punish more\nserious cases of sexual violence against women and children when the same\nought to be dealt with as sexual offences within the meaning of <a href=\"/doc/623254/\" id=\"a_38\">Section\n375</a>/<a href=\"/doc/1279834/\" id=\"a_39\">376</a> IPC in violation of <a href=\"/doc/367586/\" id=\"a_40\">Articles 14</a> and <a href=\"/doc/1199182/\" id=\"a_41\">21</a> of the Constitution of\nIndia.\n</p>\n<p data-structure=\"RespArg\" id=\"p_10\">8. It is submitted that <a href=\"/doc/1603957/\" id=\"a_42\">Article 15(3)</a> of the Constitution of India allows\nfor the State to make special provision for women and children. It follows\nthat &quot;special provision&quot; necessarily implies &quot;adequate&quot; provision. Further,\nthat the arbitrary and narrow interpretation sought to be placed by the\nrespondent authorities and their agents on <a href=\"/doc/623254/\" id=\"a_43\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_44\">376</a> renders the\neffectiveness of redress under the said Sections and in particular under\n<a href=\"/doc/334057/\" id=\"a_45\">Section 376(2)(f)</a> meaningless in violation of <a href=\"/doc/1603957/\" id=\"a_46\">Article 15(3)</a> of the\nConstitution of India. The petitioner has also referred to the U.N. Right\nof Child Convention ratified by the respondent No. 1 on 11th December, 1993\nas well as the U.N. Convention on the Elimination of Discrimination Against\nWomen which was ratified in August 1993. In view of the ratification, the\nrespondent No.l has created a legitimate expectation that it shall adhere\nto its International commitments as set out under the respective\nConventions. In the present case, however, the existing interpretation of\nrape sought to be imposed by the respondent authorities and their agents is\nin complete violation of such International commitments as have been upheld\nby this Court.\n</p>\n<p data-structure=\"Issue\" id=\"p_11\">9. By an order passed on 3.11.2000 the parties were directed to formulate\nissues which arise for consideration. Accordingly, the petitioner has\nsubmitted the following issues and legal propositions which require\nconsideration by the Court :\n</p>\n<blockquote id=\"blockquote_6\">(a)     Given that modern feminist legal theory and jurisprudence look at\nrape as an experience of humiliation, degradation and violation rather than\nan outdated notion of penile/vaginal penetration, whether the tern &quot;rape&quot;\n</blockquote><p data-structure=\"Section\" id=\"p_12\">should today be understood to include not only forcible penile/vaginal\npenetration but all forms of forcible penetration including penile/oral\npenetration, penile/anal penetration, object or finger/vaginal and object\nor finger/anal penetration.\n</p>\n<p data-structure=\"Issue\" id=\"p_13\">(b)    Whether all forms of non-consensual penetration should not be\nsubsumed under <a href=\"/doc/623254/\" id=\"a_47\">Section 375</a> of the Indian Penal code and the same should not\nbe limited to penile vaginal penetration only.\n</p>\n<p data-structure=\"Section\" id=\"p_14\">(c)    In particular, given the widespread prevalence of child sexual abuse\nand bearing in mind the provisions of the <a href=\"/doc/1732853/\" id=\"a_48\">Criminal Law (Amendment) Act,\n1983</a> which specifically inserted Section 376(2)(f) envisaging the offence\nof &quot;rape&quot; of a girl child howsoever young below 12 years of age, whether\nthe expression &quot;sexual intercourse&quot; as contained in <a href=\"/doc/623254/\" id=\"a_49\">Section 375</a> of the\nIndian Penal Code should correspondingly include all forms of penetration\nsuch as penile/vaginal penetration, penile/oral penetration, penile/anal\npenetration, finger/vagina and finger/anal penetration and object/vaginal\npenetration; and whether the expression &quot;penetration&quot; should not be so\nclarified in the Explanation to section 375 of the India Penal Code.\n</p>\n<p data-structure=\"Section\" id=\"p_15\">(d)    Whether a restrictive interpretation of &quot;penetration&quot; in the\nExplanation to Section 375 (rape) defeats the very purpose and intent of\nthe provision for punishment for rape under Section 376(2)(f) &quot;Whosever\ncommits rape on a woman when she is under twelve years of age.&quot;\n</p>\n<p data-structure=\"Section\" id=\"p_16\">(e)     Whether, penetration abuse of a child below the age of 12 should no\nlonger be arbitrarily classified according to the &#x27;type&#x27; of penetration\n(ignoring the &#x27;impact&#x27; on such child&#x27;) either as an &quot;unnatural offence&quot;\n</p><blockquote id=\"blockquote_7\">under <a href=\"/doc/1836974/\" id=\"a_50\">Section 377</a> IPC for penile/oral penetration and penile/anal\npenetration or otherwise as &quot;outraging the modesty of a woman&quot; under\nSection 354 for finger penetration or penetration with an inanimate object.\n</blockquote>\n<blockquote id=\"blockquote_8\">(f)     Whether non-consensual penetration of a child under the age of 12\nshould continue to be considered as offences under Sectoin 377 (&quot;Unnatural\nOffences&quot;) on par with certain forms of consensual penetration (such as\nconsensual homosexual sex) where a consenting party can be held liable as\nan abettor or otherwise.\n</blockquote>\n<blockquote id=\"blockquote_9\">(g)     Whether a purposive/teleological  interpretation of &quot;rape&quot; under\nSection 375/376 requires taking into account the historical disadvantage\nfaced by a particular group (in the present case, women and children) to\nshow that the existing restrictive  interpretation worsens that\ndisadvantage and for that reason fails the test of equality within the\nmeaning of <a href=\"/doc/367586/\" id=\"a_51\">Article 14</a> of the Constitution of India.\n</blockquote>\n<blockquote id=\"blockquote_10\">(h) Whether the present narrow interpretation treating only cases of\npenile/vaginal penetration as rape, adversely affects the sexual integrity\nand autonomy of women and children in violation of <a href=\"/doc/1199182/\" id=\"a_52\">Article 21</a> of\nConstitution of India.\n</blockquote>\n<p data-structure=\"Section\" id=\"p_17\">10. Counter affidavit on behalf of respondents No. 1 and 2 has been filed\nby Mr. Mukherjee, Director in the Ministry of Home Affairs. It is stated\ntherein that Sections 375 and 376 have been substantially changed by the\n<a href=\"/doc/1732853/\" id=\"a_53\">Criminal Law (Amendment) Act, 1983</a>. The same Act has also introduced\nseveral new Sections viz. 376A, 376B, 376C and 376D <a href=\"/doc/1569253/\" id=\"a_54\">IPC</a>. These sections\nhave been inserted with a view to provide special/adequate provisions for\nwomen and children. The term &quot;rape&quot; has been clearly defined under <a href=\"/doc/623254/\" id=\"a_55\">Section\n375</a> IPC. Penetration other than penile/vaginal penetration are unnatural\nsexual offences. Stringent punishments are provided for such unnatural\noffences under Section 377. The punishment provided under Section 377 is\nimprisonment for life or imprisonment of either description for a term\nwhich may extend to 10 years and shall also be liable to fine. Section 377\ndeals with unnatural offences and provides for a punishment as severe as\nthat provided for rape in Section 376. Section 354 and 506 have been framed\nwith a view to punish lesser offence of criminal assault in the from of\noutraging the modesty of a woman, whereas Sections 376 and 377 provide\nstringent punishment for sexual offences. The types of several offences as\nmentioned by the petitioner i.e. penile/ anus penetration, penile/oral\npenetration, finger/anile penetration, finger/ vaginal penetration or\nobject/vaginal penetration are serious sexual offences of unnatural nature\nand are to be covered under Section 377 which provides stringent\npunishment. Therefore, the plea of petitioner that offences under Section\n377 are treated as lesser offences is incorrect. It is also submitted in\nthe counter affidavit that penetration of the vagina, anus or urethra of\nany person with any part of the body of another person under than penile\npenetration is considered to be unnatural and has to be dealt with under\n<a href=\"/doc/1836974/\" id=\"a_56\">Section 377</a> IPC. Section 378(2)(f) provides stringent punishment for\ncommitting rape on a woman when she is under the age of 12 years. Child\nsexual abuse of any nature, other than penile penetration, is obviously\nunnatural and are to be dealt with under <a href=\"/doc/1836974/\" id=\"a_57\">Section 377</a> IPC. It is further\nsubmitted that <a href=\"/doc/203036/\" id=\"a_58\">Section 354</a> IPC provides for punishment for assault or\ncriminal force to woman to outrage her modesty. Unnatural sexual offences\ncan not be brought under the ambit of this Section. Rape defined under\nSection 375 is penile/vaginal penetration and all other sorts of\npenetration are considered to be unnatural sexual offences. Section 377\nprovides stringent punishment for such offences. It is denied that\nprovisions of Sections 375, 376 and 377 are violative of fundamental rights\nunder <a href=\"/doc/367586/\" id=\"a_59\">Articles 14</a><a href=\"/doc/1603957/\" id=\"a_60\">, 15(3)</a> and <a href=\"/doc/1199182/\" id=\"a_61\">21</a> of the Constitution of India. Sexual\npenetration as penile/anal penetration, finger/vaginal and finger/anal\npenetration and object and vaginal penetration are most unnatural forms of\nperverted sexual behaviour for which Section 377 provides stringent\npunishment.\n</p>\n<p data-structure=\"Section\" id=\"p_18\">11. Ms. Meenakshi Arora, learned counsel for the petitioner has submitted\nthat <a href=\"/doc/1569253/\" id=\"a_62\">Indian Penal Code</a> has to be interpreted in the light of the problems\nof present day and a purposive interpretation has to be given. She has\nsubmitted that <a href=\"/doc/623254/\" id=\"a_63\">Section 375</a> IPC should be interpreted in the current\nscenario, specially in regard to the fact that child abuse has assumed\nalarming proportion in recent times. Learned counsel has stressed that the\nwords &quot;sexual intercourse&quot; in <a href=\"/doc/623254/\" id=\"a_64\">Section 375</a> IPC should be interpreted to mean\nall kinds of sexual penetration of any typeof any orifice of the body and\nnot the intercourse understood in the traditional sense. The words &quot;sexual\nintercourse&quot; having not been defined in the Penal Code, there is no\nimpediment in the way of the Court to give it a wider meaning so that the\nvarious types of child abuse may come within its ambit and the conviction\nof an offender may be possible under <a href=\"/doc/1279834/\" id=\"a_65\">Section 376</a> IPC. In this connection,\nshe has referred to United Nations Convention on the elimination of all\nforms of discrimination against Women, 1979 and also Convention on the\nRights of the Child adopted by the General Assembly of the United Nations\non 20th February, 1989 and especially to <a href=\"/doc/1987997/\" id=\"a_66\">Articles 17(e)</a> and <a href=\"/doc/1218090/\" id=\"a_67\">19</a> thereof,\nwhich read as under :\n</p>\n<blockquote id=\"blockquote_11\"><a href=\"/doc/1987997/\" id=\"a_68\">ARTICLE 17</a>\n\nStates Parties recognise the important function performed by the mass media\nand shall ensure that the child has access to information and material from\na diversity of national and international sources, especially those aimed\nat the promotion of his or her social, spiritual and moral well-being and\nphysical and mental health. To this end, States Parties shall -\n</blockquote>\n<blockquote id=\"blockquote_12\">(a)    .......................... (Omitted as not relevant)\n\n</blockquote><blockquote id=\"blockquote_13\">(e) Encourage the development of appropriate guidelines for the protection\nof the child from information and material injurious to his or her well-\n</blockquote><p data-structure=\"Precedent\" id=\"p_19\">being, bearing in mind the provisions of <a href=\"/doc/134715/\" id=\"a_69\">articles 13</a> and <a href=\"/doc/1163710/\" id=\"a_70\">18.</a>\n</p>\n<p data-structure=\"Section\" id=\"p_20\"><a href=\"/doc/1218090/\" id=\"a_71\">ARTICLE 19</a>\n\n</p><p data-structure=\"Section\" id=\"p_21\">1. States Parties shall take all appropriate legislative administrative,\nsocial and educational measures to protect the child from all forms of\nphysical and mental violence, injury or abuse, neglect or negligent\ntreatment, maltreatment or exploitation including sexual abuse, while in\nthe care of parent(s), legal guardian(s) or any other persons who has the\ncare of the child.\n</p>\n<p data-structure=\"PetArg\" id=\"p_22\">2. Such protective measures should, as appropriate, include affective\nprocedures for the establishment of social programmes to provide necessary\nsupport for the child and for those who have the care of the child, as well\nas for other forms of prevention and for identification reporting,\nreferral, investigation, treatment and follow-up of instances of child\nmaltreatment described heretofore, and, as appropriate, for judicial\ninvolvement.\n</p>\n<p data-structure=\"Precedent\" id=\"p_23\">12. In support of her submission, learned counsel has referred to following\npassage of statutory interpretation by F.A.R. Bennion (Buttterworths -\n1984) at page 355-357 :\n</p>\n<blockquote id=\"blockquote_14\">&quot;While it remains law, and Act is to be treated as always speaking. In its\napplication on any date, the language of the Act, though necessarily\nembedded in its own time, is nevertheless to be construed in accordance\nwith the need to treat it as current law.\n</blockquote>\n<blockquote id=\"blockquote_15\">It is presumed that Parliament intends the Court to apply to an ongoing Act\na construction that continuously updates its wording to allow for changes\nsince the Act was initially framed.\n</blockquote>\n<blockquote id=\"blockquote_16\">In particular where, owing to developments occurring since the original\npassing of an enactment, a counter-mischief comes into existence or\nincreases. It is presumed that Parliament intends the Court so to construe\nthe enactment as to minimise the adverse effects of the counter-mischief.\n</blockquote>\n<blockquote id=\"blockquote_17\">The ongoing Act. In construing an ongoing Act, the interpreter is to\npresume that Parliament intended the Act to be applied at any future time\nin such a way as to give effect to the true original intention.\nAccordingly, the interpreter is to make allowances for any relevant changes\nthat have occurred, since the Act&#x27;s passing, in law, social conditions,\ntechnology, the meaning of words, and other matters.\n</blockquote>\n<blockquote id=\"blockquote_18\">An enactment of former days is thus to be read today, in the light of\ndynamic processing received over the years, with such modification of the\ncurrent meaning of its language as will now give effect to the original\nlegislative intention. The reality and effect of dynamic processing\nprovides the gradual adjustment. It is constituted by judicial\ninterpretation, year in and year out. It also comprises processing by\nexecutive officials.\n</blockquote>\n<blockquote id=\"blockquote_19\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1213429\" id=\"span_1\">In this connection, she has also referred to <a href=\"/doc/1213429/\" id=\"a_72\">S. Gopal Reddy v. State of\nA.P.</a>, [1996] 4 SCC 596 where the Court referred to the following words of\nLord Denning in Seaford Court Estates Ltd. V. Asher, [1949] 2 ALL ER 155 :</span>\n</blockquote>\n<blockquote id=\"blockquote_20\">&quot;.............. It would certainly save the Judges trouble if Acts of\n\nParliament were drafted with divine prescience and prefect clarity. In the\nabsence of it, when a defect appears a Judge cannot simply fold his hands\nand blame the draftsman. He must set to work on the constructive task of\nfinding the intention of Parliament, and he must do this not only from the\nlanguage of the statute, but also from a consideration of the social\nconditions which gave rise to it and of the mischief which it was passed to\nremedy, and then he must supplement the written word so as to give &#x27;force\nand life&#x27; to the intention of the legislature ........... A Judge should\nask\n\nhimself the question how, if the makers of the Act had themselves come\nacross this ruck in the texture of it, they would have straightened it out?\nHe must then do as they would have done. A judge must not alter the\nmaterial of which the Act is woven, but he can and should iron out the\ncreases.&quot;\n</blockquote>\n<p data-structure=\"Section\" id=\"p_24\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1013766\" id=\"span_2\">And held that it is a well known rule of interpretation of Statutes that\nthe text and the context of the entire Act must be looked into while\ninterpreting any of the expressions used in a Statute and that the Courts\nmust look to the object which the Statute seeks to achieve while\ninterpreting any of the provisions of the Act and a purposive approach is\nnecessary . Accordingly the words &quot;at or before or after the marriage as\nconsideration for the marriage&quot; occurring in <a href=\"/doc/1249134/\" id=\"a_73\">Section 2</a> of the Dowry\nProhibition Act were interpreted to mean demand of dowry at the\n&quot;negotiation stage&quot; as a consideration for proposed marriage and &quot;marriage&quot;\nwas held to include the &quot;proposed marriage&quot; that may not have taken place.\nReference is also made to <a href=\"/doc/1013766/\" id=\"a_74\">Directorate of Enforcement v. Deepak Mahajan &amp;\nAnr.</a>, [1994] 3 SCC 440, wherein it was held that a mere mechanical\ninterpretation of the words devoid of concept or purpose will reduce most\nof legislation to futility and that it is a salutary rule, well\nestablished, that the intention of the legislature must be found by reading\nthe Statute as a whole. Accordingly, certain provisions of <a href=\"/doc/600757/\" id=\"a_75\">FERA and Customs\nAct</a> were interpreted keeping in mind that the said enactments were enacted\nfor the economic development of the country and augmentation of revenue.\nThe Court did not accept the literal interpretation suggested by the\nrespondent therein and held that sub-section (1) and (2) of Section 167 Cr.\nP.C. are squarely applicable with regard to the production and detention of\na person arrested under the provisions of Section 35 of FERA and <a href=\"/doc/1771476/\" id=\"a_76\">Section\n104</a> of Customs Act and that a Magistrate has jurisdiction under Section\n167(2) Cr. P.C. to authorise detention of a person arrested by an\nauthorised officer of the Enforcement Directorate under FERA and taken to\nthe Magistrate in compliance of Section 35(2) of FERA.</span>\n</p>\n<p data-structure=\"Precedent\" id=\"p_25\"><span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"1353689\" id=\"span_3\">13. Ms. Meenakshi Arora has submitted that this purposive approach is being\nadopted in some of other countries so that the criminals do not go\nunscathed on mere technicality of law. She has placed strong reliance on\nsome decisions of House of Lords to substantiate her contentions and the\nmost notable being <a href=\"/doc/1353689/\" id=\"a_77\">R. v. R</a>, [1991] 4 All ER 481 where it was held as under</span>\n</p><blockquote id=\"blockquote_21\">:\n</blockquote>\n<blockquote id=\"blockquote_22\">&quot;The rule that a husband cannot be criminally liable for raping his wife if\nhe has sexual intercourse with her without her consent no longer forms part\nof the law of England since a husband and wife are now to be regarded as\nequal partners in marriage and it is unacceptable that by marriae the wife\nsubmits herself irrevocably to sexual intercourse in all circumstances or\nthat it is an incident of modern marriage that the wife consents to\nintercourse in all circumstances, including sexual intercourse obtained\nonly by force. In Section 1(1) of the Sexual Offences (Amendment) Act,\n1976, which defines rape as having &#x27;unlawful&#x27; intercourse with a woman\nwithout her consent, the word &#x27;unlawful&#x27; is to be treated as mere\nsurplusage and not as meaning &#x27;outside marriage&#x27;, since it is clearly\nunlawful to have sexual intercourse with any woman without her consent.&quot;\n</blockquote>\n<p data-structure=\"Precedent\" id=\"p_26\">The other decision cited by learned counsel is Regina v. Burstow and Regina\nv. Ireland, [1997] 4 All ER 74 where a person accused of repeated silent\ntelephone calls accompanied on occasions by heavy breathing to women was\nheld guilty of causing psychiatric injury amounting to bodily harm under\nSection 42 of Offences against the Person Act, 1861. In the course of the\ndiscussion, Lord Steyn observed that the criminal law has moved on in the\nlight of a developing understanding of the link between the body and\npsychiatric injury and as a matter of current usage, the contextual\ninterpretation of &quot;inflict&quot; can embrace the idea of one person inflicting\npsychiatric injury on another. It was further observed that the\ninterpretation and approach should, so far as possible, be adopted which\ntreats the ladder of offences as a coherent body of law. Learned counsel\nhas laid emphasis on the following passage in the judgment :\n</p>\n<blockquote id=\"blockquote_23\">&quot;The proposition that the Victorian legislator when enacting <a href=\"/doc/1732853/\" id=\"a_78\">section 18</a>, <a href=\"/doc/1732853/\" id=\"a_79\">20</a>\nand <a href=\"/doc/1732853/\" id=\"a_80\">47</a> of the Act 1861, would not have had in mind psychiatric illness is\nno doubt correct. Psychiatry was in its infancy in l861. But the subjective\nintention of the draftsman is immaterial. The only relevant enquiry is as\nto the sense of the words in the context in which they are used. Moreover\nthe Act of 1861 is a statute of the &quot;always speaking&quot; type : the statute\nmust be interpreted in the light of the best current scientific\nappreciation of the link between the body and psychiatric injury.&quot;\n</blockquote>\n<p data-structure=\"Section\" id=\"p_27\">It has thus been contended that the words &quot;sexual intercourse&quot; occurring in\n<a href=\"/doc/623254/\" id=\"a_81\">Section 375</a> IPC must be given a larger meaning than as traditionally\nunderstood having regard to the monstrous proportion in which the cases of\nchild abuse have increased in recent times. She has also referred to a\ndecision of Constitutional Court of South Africa in the National Coalition\nfor Gay and Lesbian Equality &amp; Ors. v. The Minister of Home Affairs and\nOrs., Case CCT 10/99 wherein it was held that Section 25(5) of the Aliens\nControl Act 96 of 1991, by omitting to confer on persons, who are partners\nin permanent same sex life partnerships, the benefits it extends to\nspouses, unfairly discriminates, on the grounds of their sexual orientation\nand marital status, against partners in such same-sex partnerships who are\npermanently and lawfully resident in the Republic. Such unfair\ndiscrimination limits the equality rights of such partners guaranteed to\nthem by <a href=\"/doc/16904705/\" id=\"a_82\">section 9</a> of the Constitution and their right to dignity under\nSection 10. It was further held that it would not be an appropriate remedy\nto declare the whole of section 25(5) invalid. Instead, it would be\nappropriate to read in, after the word &quot;spouse&quot; in the section, the words\n&quot;or partner, in a permanent same-sex life partnership&quot;.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_28\">14.  Ms. Meenakshi Arora has also placed before the Court the judgments\nrendered on 10th December, 1998 and 22nd February, 2001 by the\nInternational Tribunal for the Prosecution of Persons Responsible for\nSerious Violations of International Humanitarian Law Committed in the\nTerritory of the Former Yugoslavia since 1991. Under <a href=\"/doc/1937835/\" id=\"a_83\">Article 5</a> of the\nStatute of the International Tribunal, rape is a crime against humanity.\nRape may also amount to a grave breach of the Geneva Conventions, a\nviolation of the laws or customs of the war or an act of genocide, if the\nrequisite elements are met, and may be prosecuted accordingly. The Trial\nChamber after taking note of the fact that no definition of rape can be\nfound in international law, proceeded on the following basis :\n</p>\n\n\n<blockquote id=\"blockquote_24\">&quot;Thus, the Trial Chamber finds that the following may be accepted as the\nobjective elements of rape :\n</blockquote>\n<pre id=\"pre_2\">(i)    the sexual penetration, however slight :\n\n(a)    of the vagina or anus of the victim by the penis of the perpetrator\nor any other object used by the perpetrator, or\n\n(b)    of a mouth of the victim by the penis of the perpetrator.\n\n</pre><blockquote id=\"blockquote_25\">(ii)   by coercion or force or threat of force against the victim or a\nthird person.&quot;\n</blockquote>\n<p data-structure=\"Precedent\" id=\"p_29\">In the second judgment of the Trial Chamber dated 22nd February, 2001, the\ninterpretation which focussed on serious violations of a sexual autonomy\nwas accepted.\n</p>\n<p data-structure=\"Precedent\" id=\"p_30\"><span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"551554\" id=\"span_4\"><span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"1031794\" id=\"span_5\">15. Shri R.N. Trivedi, learned Additional Solicitor General, appearing for\nthe respondents, has submitted that International Treaties ratified by\nIndia can be taken into account for framing guidelines in respect of\nenforcement of fundamental rights but only in absence of municipal laws as\nheld in <a href=\"/doc/1031794/\" id=\"a_84\">Vishaka v. State of Rajasthan</a>, [1997] 6 <a href=\"/doc/551554/\" id=\"a_85\">SCC 241 and Lakshmi Kant\nPandey v. Union of India</a>, [1984] 2 SCC 244. When laws are already existing,\nsubsequent ratification of International Treaties would not render existing\nmunicipal laws ultra vires of Treaties in case of inconsistency. In such an\nevent the State through its legislative wing can modify the law to bring it\nin accord with Treaty obligations. Such matters are in the realm of State\npolicy and are, therefore, not enforceable in a Court of law. He has\nfurther submitted that in International law, ratified Treaties can be\ndeemed interpreted in customary law unless the former are inconsistent with\nthe domestic laws or decisions of its judicial Tribunals. The decision of\nthe International Tribunal for the Crimes committed in the Territory of the\nFormer Yugoslavia cannot be used for interpretation of <a href=\"/doc/203036/\" id=\"a_86\">Section 354</a> and <a href=\"/doc/623254/\" id=\"a_87\">375</a>\nIPC and other provisions. Even decisions of International Court of Justice\nare binding only on the parties to a dispute or intervenors in view of\n<a href=\"/doc/504161/\" id=\"a_88\">Articles 92</a><a href=\"/doc/986229/\" id=\"a_89\">, 93</a> and <a href=\"/doc/1070732/\" id=\"a_90\">94</a> of the UN Charter and <a href=\"/doc/858095/\" id=\"a_91\">Articles 59</a> and <a href=\"/doc/694525/\" id=\"a_92\">63</a> of the IJC\nStatutes. Learned counsel has also submitted that no writ of mandamus can\nbe issued to the Parliament to amend any law or to bring it in accord with\nTreaty obligations. He has also submitted that <a href=\"/doc/203036/\" id=\"a_93\">Sections 354</a> and <a href=\"/doc/623254/\" id=\"a_94\">375</a> IPC\nhave been interpreted in innumerable decisions of various High Courts and\nalso of the Supreme Court and the consistent view is that to hold a person\nguilty of rape, penile penetration is essential The law on the point is\nsimilar both in England and USA.</span></span> <span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"960519\" id=\"span_6\">In <a href=\"/doc/960519/\" id=\"a_95\">State of Punjab v. Major Singh</a>, [1966]\nSupp. SCR 266 it was held that if the hymen is ruptured by inserting a\nfinger, it would not amount to rape. Lastly, it has been submitted that a\nwrit petition under <a href=\"/doc/981147/\" id=\"a_96\">Article 32</a> of the Constitution would not lie for\nreversing earlier decisions of the Court on the supposed ground that a\nrestrictive interpretation has been given to certain provisions of a\nStatute.</span>\n</p>\n<p data-structure=\"Precedent\" id=\"p_31\">16. In support of his submission Shri Trivedi has placed reliance on Volume\n11(1) of Halsbury&#x27;s Laws of England para 514 (Butterworths -1990) wherein\nunlawful sexual intercourse with woman without her consent has been held to\nbe an essential ingredient of rape. Reference has also been made to Volume\n75 Corpus Juris Secundum para 10, wherein it is stated that sexual\npenetration of a female is a necessary element of the crime of rape, but\nthe slightest penetration of the body of the female by the sexual organ of\nthe male is sufficient. Learned counsel has also referred to Principles of\nPublic International Law by Ian Brownlie, where the learned author, after\nreferring to some decisions of English Courts has expressed an opinion that\nthe clear words of a Statute bind the Court even if the provisions are\ncontrary to international law and that there is no such thing as a standard\nof international law extraneous to the domestic law by a Kingdom and that\ninternational law as such can confer no rights cognizable in the municipal\ncourts. Learned counsel has also referred to Dicey and Moris on The\nConflict of Laws wherein in the Chapter on the enforcement of foreign law,\nfollowing Rule has been stated :\n</p>\n<blockquote id=\"blockquote_26\">&quot;English Courts will not enforce or recognise a right, power, capacity,\ndisability or legal relationship arising under the law of a foreign\ncountry, if the enforcement or recognition of such right, power, capacity,\ndisability or legal relationship would be inconsistent with the fundamental\npublic policy of English law.&quot;\n</blockquote>\n<p data-structure=\"Section\" id=\"p_32\">With regard to penal law, it has been stated as under :\n</p>\n<blockquote id=\"blockquote_27\">&quot;The common law considers crimes as altogether local, and cognisable and\npunishable exclusively in the country where they\n\nare committed...........Chief Justice Marshall, in delivering the\n\nopinion of the Supreme Court, said : &#x27;The Courts of no country execute the\npenal laws of another&#x27;.&quot;\n</blockquote>\n<p data-structure=\"Section\" id=\"p_33\">17. This Court on 13.1.1998 referred the matter to the Law Commission of\nIndia for its opinion on the main issue raised by the petitioner, namely,\nwhether all forms of penetration would come within the ambit of <a href=\"/doc/623254/\" id=\"a_97\">Section 375</a>\nIPC or whether any change in statutory provisions need to be made, and if\nso, in what respect? The Law Commission had considered some of the matters\nin its 156th Report and the relevant extracts of the recommendation made by\nit in the said Report, concerning the issue involved, were placed before\nthe Court. Para 9.59 of the Report read as under :\n</p>\n<blockquote id=\"blockquote_28\">&quot;9.59 Sexual-child abuse may be committed in various forms such as sexual\nintercourse, carnal intercourse and sexual assaults. The cases involving\npenile penetration into vagina are covered under <a href=\"/doc/623254/\" id=\"a_98\">Section 375</a> of the IPC. If\nthere is any case of penile oral penetration and penile penetration into\nanus, <a href=\"/doc/1836974/\" id=\"a_99\">Section 377</a> IPC dealing with unnatural offences, i.e., carnal\nintercourse against the order of nature with any man, woman or animal,\nadequately takes care of them. If acts such as penetration of finger or any\ninanimate object into vagina or anus are committed against a woman or a\nfemale child, the provisions of the proposed <a href=\"/doc/203036/\" id=\"a_100\">Section 354</a> IPC whereunder a\nmore severe punishment is also prescribed can be invoked and as regards the\nmale child, the penal provisions of the <a href=\"/doc/1569253/\" id=\"a_101\">IPC</a> concerning &#x27;hurt&#x27;, &#x27;criminal\nforce&#x27; or assault&#x27; as the case may be, would be attracted. A distinction\nhas to be naturally maintained between sexual assault/use of criminal force\nfalling under Section 354, sexual offences falling under Section 375 and\nunnatural offences falling under <a href=\"/doc/1836974/\" id=\"a_102\">Section 377</a> of the Indian Penal Code. It\nmay not be appropriate to bring unnatural offences punishable under <a href=\"/doc/1836974/\" id=\"a_103\">Section\n377</a> IPC or mere sexual assault or mere sexual use of criminal force which\nmay attract <a href=\"/doc/203036/\" id=\"a_104\">Section 354</a> IPC within the ambit of &#x27;rape&#x27; which is a distinct\nand graver offence with a definite connection. It is needless to mention\nthat any attempt to commit any of these offences is also punishable by\nvirtue of <a href=\"/doc/1185693/\" id=\"a_105\">Section 511</a> IPC. Therefore, any other or more changes regarding\nthis law may not be necessary.&quot;\n</blockquote>\n<p data-structure=\"Facts\" id=\"p_34\">Regarding <a href=\"/doc/1836974/\" id=\"a_106\">Section 377</a> IPC, the Law Commission recommended that in view of\nthe ongoing instances of sexual abuse in the country where unnatural\noffences is committed on a person under age of eighteen years, there should\nbe a minimum mandatory sentence of imprisonment for a term not less than\ntwo years but may extend to seven years and fine, with a proviso that for\nadequate and special reasons to be recorded in the judgment, a sentence of\nless than two years may be imposed. The petitioner submitted the response\non the recommendations of the Law Commission. On 10/18.2.2000, this Court\nagain requested the Law Commission to consider the comments of\nrepresentative organisations (viz. SAKSHI, IFSHA and AIDWA).\n</p>\n<p data-structure=\"Section\" id=\"p_35\">18. The main question which requires consideration is whether by a process\nof judicial interpretation the provisions of <a href=\"/doc/623254/\" id=\"a_107\">Section 375</a> IPC can be so\naltered so as to include all forms of penetration such as penile/vaginal\npenetration, penile/oral penetration, penile/anal penetration,\nfinger/vagina and finger/anal penetration and object/vaginal penetration\nwithin its ambit. Section 375 uses the expression &quot;sexual intercourse&quot; but\nthe said expression has not been defined. The dictionary meaning of the\nword &quot;sexual intercourse&quot; is hetrosexual intercourse involving penetration\nof the vagina by the penis. The <a href=\"/doc/1569253/\" id=\"a_108\">Indian Penal Code</a> was drafted by the First\nIndian Law Commission of which Lord Mecaulay was the President. It was\npresented to the Legislative Council in 1856 and was passed on October 6,\n1860. The Penal Code has undergone very few changes in the last more than\n140 years. Except for clause sixthly of Section 375 regarding the age of\nthe woman (which in view of Section 10 denotes a female human being of any\nage) no major amendment has been made in the said provision. Sub-section\n(2) of Section 376 and Sections 376A to 376D were inserted by <a href=\"/doc/1732853/\" id=\"a_109\">Criminal Law\n(Amendment) Act, 1983</a> but sub-section (2) of Section 376 merely deals with\nspecial types of situations and provides for a minimum sentence of 10\nyears. It does not in any manner alter the definition of &#x27;rape&#x27; as given in\nSectoin 375 <a href=\"/doc/1569253/\" id=\"a_110\">IPC</a>. Similarly, Section 354 which deals with assault or\ncriminal force to woman with intent to outrage her modesty and Section 377\nwhich deals with unnatural offences have not undergone any major amendment.\n</p>\n<p data-structure=\"Section\" id=\"p_36\">19.  It is well settled principle that the intention of the Legislature is\nprimarily to be gathered form the language used, which means that attention\nshould be paid what has been said as also to what has not been said. As a\nconsequence a construction which requires for its support addition or\nsubstitution of words or which results in rejection of words as meaningless\nhas to be avoided. It is contrary to all rules of construction to read\nwords into an Act unless it is absolutely necessary to do so. Similarly it\nis wrong and dangerous to proceed by substituting some other words for\nwords of the statute. It is equally well settled that a statute enacting an\noffence or imposing a penalty is strictly construed. The fact that an\nenactment is a penal provision is in itself a reason for hesitating before\nascribing to phrases used in it a meaning broarder than that they would\nordinarily bear. (Principles of Statutory Interpretation by Justice G.P.\nSingh p. 58 and 751 Ninth Edition).\n</p>\n<p data-structure=\"Section\" id=\"p_37\">20.  <a href=\"/doc/203036/\" id=\"a_111\">Sections 354</a>, <a href=\"/doc/623254/\" id=\"a_112\">375</a> and <a href=\"/doc/1836974/\" id=\"a_113\">377</a> IPC have come up for consideration before\nthe superior courts of the country on innumerable occasions in a period of\nalmost one and a half century. Only sexual intercourse, namely, hetrosexual\nintercourse involving penetration of the vagina by the penis coupled with\nthe explanation that penetration is sufficient to constitute the sexual\nintercourse necessary for the offence of rape has been held to come within\nthe purview of <a href=\"/doc/623254/\" id=\"a_114\">Section 375</a> IPC. The wide definition which the petitioner\nwants to be given to &quot;rape&quot; as defined in <a href=\"/doc/623254/\" id=\"a_115\">Section 375</a> IPC so that the same\nmay become an offence punishable under <a href=\"/doc/1279834/\" id=\"a_116\">Section 376</a> IPC has neither been\nconsidered nor accepted by any Court in India so far. Prosecution of an\naccused for an offence under <a href=\"/doc/1279834/\" id=\"a_117\">section 376</a> IPC on radically enlarged meaning\nof <a href=\"/doc/623254/\" id=\"a_118\">section 375</a> IPC as suggested by the petitioner may violate the guarantee\nenshrined in <a href=\"/doc/1501707/\" id=\"a_119\">Article 20(1)</a> of the Constitution which says that no person\nshall be convicted of any offence except for violation of a law in force at\nthe time of the commission of the act charged as an offence, nor be\nsubjected to a penalty greater than that which might have been inflicted\nunder the law in force at the time of the commission of the offence.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_38\"><span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"1353689\" id=\"span_7\">21. The decision of Constitutional Court of South Africa cited by learned\ncounsel for the petitioner does not commend to us as the Court there\ntreated &quot;Gays and Lesbian in permanent same sex life partnerships&quot; at par\nwith &quot;spouses&quot; and took upon itself the task of Parliament in holding that\nin section 25(2) of the Aliens Control Act, after the word &quot;spouse&quot;, the\nwords &quot;or partner in a permanent same sex life partnership&quot; should be read.\nThe decision of House of Lords in <a href=\"/doc/1353689/\" id=\"a_120\">R. v. R.</a> was given on its own Facts which\ndeserve notice. Here the wife had left her matrimonial home with her son on\n21st October, 1989 and went to live with her parents. She had consulted\nsolicitors about matrimonial problems and had left a letter for the husband\ninforming him that she intended to petition for divorce. On 23rd October,\n1989 the husband spoke to his wife on telephone indicating that it was his\nintention also to seek divorce. In the night of 12th November; 1989 the\nhusband forced his way into the house of his wife&#x27;s parents, who were out\nat that time and attempted to have sexual intercourse with her against her\nwill. In the course of doing so he assaulted her by squeezing her neck with\nboth hands. On the facts of the case the conviction of the husband may not\nbe illegal. It is very doubtful whether the principle laid down can be of\nuniversal application.</span> In Regina v. Burstow psychiatric injury was held to\nbe bodily harm under section 20, having regard to the meaning of the word\nin the usage of the present day. In our opinion the judgment of the\nInternational Tribunal can have no application here as Tribunal itself\nnoted that no definition of rape can be found in International law and it\nwas dealing with prosecution of persons responsible for serious violations\nof International Humanitarian Law committed in the Territory of former\nYugoslavia. The judgment is not at all concerned with interpretation of any\nprovision of domestic law in peace time conditions. The decisions cited by\nthe learned counsel for the petitioner, therefore, do not persuade us to\nenlarge the definition of rape as given in <a href=\"/doc/623254/\" id=\"a_121\">section 375</a> IPC, which has been\nconsistently so understood for over a century through out the country.\n</p>\n<p data-structure=\"Section\" id=\"p_39\">22.  It may be noted that ours is a vast and big country of over 100 crore\npeople. Normally, the first reaction of a victim of crime is to report the\nincident at the police station and it is the police personnel who register\na case under the appropriate Sections of the Penal Code. Such police\npersonnel are invariably not highly educated people but they have studied\nthe basic provisions of the <a href=\"/doc/1569253/\" id=\"a_122\">Indian Penal Code</a> and after registering the\ncase under the appropriate sections, further action in taken by them as\nprovided in <a href=\"/doc/445276/\" id=\"a_123\">Code of Criminal Procedure</a>. <a href=\"/doc/1569253/\" id=\"a_124\">Indian Penal Code</a> is a part of the\ncurriculum in the law degree and it is the existing definition of &quot;rape&quot; as\ncontained in <a href=\"/doc/623254/\" id=\"a_125\">Section 375</a> IPC which is taught to every student of law. A\ncriminal case is initially handled by a Magistrate and thereafter such\ncases as are exclusively triable by Court of Session are committed the\nCourt of Session. The entire legal fraternity of India, lawyers or Judges,\nhave the definition as contained in <a href=\"/doc/623254/\" id=\"a_126\">Section 375</a> IPC engrained in their mind\nand the cases are decided on the said basis. The first and foremost\nrequirement in criminal law is that it should be absolutely certain and\nclear. An exercise to alter the definition of rape, as contained in <a href=\"/doc/623254/\" id=\"a_127\">Section\n375</a> IPC, by a process of judicial interpretation, and that too when there\nis no ambiguity in the provisions of the enactment, is bound to result in\ngood deal of chaos and confusion, and will not be in the interest of\nsociety at large.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_40\">23. Stare decisis is a well known doctrine in legal jurisprudence. The\ndoctrine of stare decisis, meaning to stand by decided cases, rests upon\nthe principle that law by which men are governed should be fixed, definte\nand known, and that, when the law is declared by court of competent\njurisdiction authorised to construe it, such declaration, in absence of\npalpable mistake or error, is itself evidence of the law until changed by\ncompetent authority. It requires that rules of law when clearly announced\nand established by a Court of last resort should not be lightly disregarded\nand set aside but should be adhered to and followed. What it precludes is\nthat where a principle of law has become established by a series of\ndecisions, it is binding on the Courts and should be followed in similar\ncases. It is a wholesome doctrine which gives certainty to law and guides\nthe people to mould their affairs in future.\n</p>\n<p data-structure=\"Precedent\" id=\"p_41\">24. <span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"191199\" id=\"span_8\">In <a href=\"/doc/191199/\" id=\"a_128\">Mishri Lal v. Dhierendra Nath</a>, [1999] 5 SCC 11 importance of this\ndoctrine was emphasised for the purpose of avoiding uncertainty and\nconfusion and paras 14, 15, 16 and 21 of the Reports read as under :</span>\n</p>\n<blockquote id=\"blockquote_29\">&quot;14. This Court in Muktul v. Manbhari, AIR (1958) SC 918 explained the\nscope of the doctrine of stare decisis with reference to Halsbury&#x27;s Laws of\nEngland and Corpus Juris Secundum in the following manner :\n</blockquote>\n<blockquote id=\"blockquote_30\">&quot;The principle of stare decisis is thus stated in Halsbury&#x27;s Laws of\nEngland, 2nd Edn. :\n</blockquote>\n<blockquote id=\"blockquote_31\">&quot;Apart from any question as to the courts being of coordinate jurisdiction,\na decision which has been followed for a long period of time, and has been\nacted upon by persons in the formation of contracts or in the disposition\nof their property, or in the general conduct of affairs, or in legal\nprocedure or in other ways, will generally be followed by courts of higher\nauthority than the court establishing the rule, even though the court\nbefore whom the matter arises afterwards might not have given the same\ndecision had the question come before it originally. But the Supreme\nAppellate Court will not shrink from overruling a decision, or series of\ndecisions, which establish a doctrine plainly outside the statute and\noutside the common law, when no title and no contract will be shaken, no\npersons can complain, and no general course of dealing be altered by the\nremedy of a mistake.&quot; The same doctrine is thus explained in Corpus Juris\nSecundum -\n</blockquote>\n<blockquote id=\"blockquote_32\">&quot;Under the stare decisis rule, a principle of law which has become settled\nby a series decisions generally is binding on the courts and should be\nfollowed in similar cases. This rule is based on expediency and public\npolicy, and, although generally it should be strictly adhered to by the\ncourts, it is not universally applicable.&quot;\n</blockquote>\n<p data-structure=\"Precedent\" id=\"p_42\">15. Be it noted however that Corpus Juris Secundum adds a rider that\n\n&quot;previous decisions should not be followed to the extent that grievous\nwrong may result; and, accordingly, the courts ordinarily will not adhere\nto a rule of principle established by previous decisions which they are\nconvinced is erroneous. The rule of stare decisis is not so imperative or\ninflexible as to preclude a departure therefrom in any case, but its\napplication must be determined in each case by the discretion of the court,\nand previous decisions should not be followed to the extent that error may\nbe perpetuated and grievous wrong may result.&quot;\n</p>\n<p data-structure=\"CDiscource\" id=\"p_43\">16.  The statement though deserves serious consideration in the event of a\ndefinite finding as to the perpetration of a grave wrong but that by itself\ndoes not denude the time-tested doctrine of stare decisis of its efficacy.\nTaking recourse to the doctrine would be an imperative necessity to avoid\nuncertainty and confusion. The basic feature of law is its certainty and in\nthe event of there being uncertainty as regards the state of law - the\nsociety would be in utter confusion the resultant effect of which would\nbring about a situation of chaos - a situation which ought always to be\navoided.\n</p>\n<p data-structure=\"Precedent\" id=\"p_44\">21. In this context reference may also be made to two English decisions :\n</p>\n<blockquote id=\"blockquote_33\">(a)    in Admiralty Commrs. v. Valverda (Owners), (1938) AC 173 (AC at p.\n</blockquote><blockquote id=\"blockquote_34\">194) wherein the House of Lords observed that even long established\nconveyancing practice, although not as authoritative as a judicial\ndecision, will cause the House of Lords to hesitate before declaring it\nwrong, and\n</blockquote><blockquote id=\"blockquote_35\">(b)    in Button v. Director of Public Prosecution, (1966) AC 591 the House\nof Lords observed :\n</blockquote>\n\n<blockquote id=\"blockquote_36\">&quot;In Corpus Juris Secundum, a contemporary statement of American Law, the\nstare decisis rule, has been stated to be a principle of law which has\nbecome settled by a series of decisions generally, is binding on the courts\nand should be followed in similar cases. It has been stated that this rule\nis based on expediency and public policy and should be strictly adhered to\nby the courts. Under this rule courts are bound to follow the common law as\nit has been judicially declared in previously adjudicated cases and rules\nof substantive law should be reasonably interpreted and administered. This\nrule has to preserve the harmony and stability of the law and to make as\nsteadfast as possible Judically declared principles affecting the rights of\nproperty, it being indispensable to the due administration of justice,\nespecially by a court of last resort, that a question once deliberately\nexamined and declared should be considered as settled and closed to further\nargument. It is a salutary rule, entitled to great weight and ordinarily\nshould be strictly adhered to by the courts. The courts are slow to\ninterfere with\nthe\n\nprinciple announced by the decision, and it may be upheld even though they\nwould decide otherwise were the question a new one, or equitable\nconsiderations might suggest a different result and although it has been\nerroneously applied in a particular case. The rule represents an element of\ncontinuity in law and is rooted in the psychologic need to satisfy\nreasonable expectations, but it is a principle of policy and not a\nmechanical formula of adherence to the latest decision however recent and\nquestionable when such adherence involves collision with a prior doctrine\nmore embracing in its scope, intrinsically sounder and verified by\nexperience.&quot;\n</blockquote>\n<p data-structure=\"Precedent\" id=\"p_45\">25. It may be noticed that on July 26, 1966, the House of Lords made a\ndepartment from its past practice when a statement was made to the\nfollowing effect :\n</p>\n<blockquote id=\"blockquote_37\">&quot;Their lordships regard the use of precedent as an indispensably foundation\nupon which to decide what is the law and its application to individual\ncases. It provides at least some degree of certainty upon which individuals\ncan rely in the conduct of their affairs, as well as a basis for orderly\ndevelopment of legal rules.\n</blockquote>\n<blockquote id=\"blockquote_38\">Their lordships nevertheless recognise that too rigid adherence to\nprecedent may lead to injustice in a particular case and also unduly\nrestrict the proper development of the law. They propose therefore to\nmodify their present practice and, while treating former decisions of this\nHouse as normally binding, to depart from a previous decision when it\nappears right to do so.\n</blockquote>\n<blockquote id=\"blockquote_39\">In this connection they will bear in mind the danger of disturbing\nretrospectively the basis on which contracts, settlements of property and\nfiscal arrangements have been entered into and also the especial need for\ncertainty as to the criminal law.\n</blockquote>\n<blockquote id=\"blockquote_40\">This announcement is not intended to affect the use of precedent elsewhere\nthan in this House.&quot;\n</blockquote>\n<p data-structure=\"CDiscource\" id=\"p_46\">26. While making the above statement a rule of caution was sounded that\nwhile departing from a previous decision when it appears right to do so,\nthe especial need for certainty as to criminal law shall be borne in mind.\nThere is absolutely no doubt or confusion regarding the interpretation of\nprovisions of <a href=\"/doc/623254/\" id=\"a_129\">Section 375</a> IPC and the law is very well settled. The inquiry\nbefore the Courts relate only to the factual aspect of the matter which\ndepends upon the evidence available on the record and not on the legal\naspect. Accepting the contention of the writ petitioner and giving a wider\nmeaning to <a href=\"/doc/623254/\" id=\"a_130\">Section 375</a> IPC will lead to a serious confusion in the minds of\nprosecuting agency and the Courts which instead of achieving the object of\nexpeditiously bringing a criminal to book may unnecessarily prolong the\nlegal proceedings and would have an adverse impact on the society as a\nwhole. We are, therefore, of the opinion that it will not be in the larger\ninterest of the State or the people to alter the definition of &quot;rape&quot; as\ncontained in <a href=\"/doc/623254/\" id=\"a_131\">Section 375</a> IPC by a process of judicial interpretation as is\nsought to be done by means of the present writ petition.\n</p>\n<p data-structure=\"Precedent\" id=\"p_47\">27.   The other aspect which  has been highlighted and needs consideration\nrelates to providing protection to a victim of sexual abuse at the time of\nrecording this statement in court. The main suggestions made by the\npetitioner are for incorporating special provisions in child sexual abuse\ncases to the following effect :\n</p>\n<blockquote id=\"blockquote_41\">(i) permitting use of a videotaped interview of the child&#x27;s statement by\nthe judge (in the presence of a child support person).\n</blockquote>\n<blockquote id=\"blockquote_42\">(ii) allow a child to testify via closed circuit television or from behind\na screen to obtain a full and candid account of the acts complained of.\n</blockquote>\n<blockquote id=\"blockquote_43\">(iii) The cross examination of a minor should only be carried out by the\njudge based on written questions submitted by the defense upon perusal of\nthe testimony of the minor.\n</blockquote>\n<blockquote id=\"blockquote_44\">(iv) Whenever a child is required to give testimony, sufficient breaks\nshould be given as and when required by the child.\n</blockquote>\n<p data-structure=\"Precedent\" id=\"p_48\">28.  The Law Commission, in its response, did not accept the said request\nin view of <a href=\"/doc/1151812/\" id=\"a_132\">Section 273</a> Cr.P.C.   as in its opinion the principle of the\nsaid Section which is founded upon natural justice, cannot be done away in\ntrials and inquiries concerning sexual offences. The Commission, however,\nobserved that in an appropriate case it may be open to the prosecution to\nrequest the Court to provide a screen in such a manner that the victim does\nnot see the accused while at the same time provide an opportunity to the\naccused to listen to the testimony of the victim and give appropriate\ninstructions to his counsel for an effective cross-examination. The Law\nCommission suggested that with a view to allay any apprehensions on this\nscore, a proviso can be placed above the Explanation to <a href=\"/doc/1151812/\" id=\"a_133\">section 273</a> of the\nCriminal Procedure Code to the following effect : &quot;Provided that where the\nevidence of a person below sixteen years who is alleged to have been\nsubjected to sexual assault or any other sexual offence, is to be recorded,\nthe Court may, take appropriate measures to ensure that such person is not\nconfronted by the accused while at the same time ensuring the right of\ncross-examination of the accused&quot;.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_49\">29. Ms. Meenakshi Arora has referred to a decision of the Canadian Supreme\nCourt in Her Majesty The Queen, Appellant v. D.O.L., Respondent and the\nAttorney General of Canada. Etc., [1995] 4 SCR 419. wherein the\nconstitutional validity of Section 715.1 of the Criminal Code was examined.\nThis section provides that in any proceeding relating to certain sexual\noffences in which the complainant was under age of eighteen years at the\ntime the offence is alleged to have been committed, a videotape made within\na reasonable time after the alleged offence in which the complainant\ndescribes the act complained of, is admissible in evidence, if the\ncomplainant while testifying adopts the contents of the videotape. The\nCourt of Appeal had declared Section 715.1 unconstitutional on the ground\nthat the same contravened <a href=\"/doc/1194614/\" id=\"a_134\">Sections 7</a> and <a href=\"/doc/1683849/\" id=\"a_135\">1</a> l(d) of the Canadian Charter of\nRights and Freedoms and could not be sustained under <a href=\"/doc/1683849/\" id=\"a_136\">Section 1</a>. The Supreme\nCourt took note of some glaring features in such type of cases viz. the\ninnate power imbalance which exists between abuser and the abused child; a\nfailure to recognise that the occurrence of child sexual abuse is one\nintertwined with the sexual abuse of all women, regardless of age; and that\nthe Court cannot disregard the propensity of victims of sexual abuse to\nfail to report the abuse in order to conceal their plight from institutions\nwithout the criminal justice system which hold stereotypical and biased\nviews about the victimisation of women. The Court accordingly held that the\nprocedures set out in Section 715.1 are designed to diminish the stress and\ntrauma suffered by child complainants as a byproduct of their role in the\ncriminal justice system. The &quot;system induced trauma&quot; often ultimately\nserves to revictimise the young complainant. The Section was intended to\npreserve the evidence of the Child and to remove the need for them to\nrepeat their story many times. It is often repetition of the story that\nresults in the infliction of trauma and stress upon a child who is made to\nbelieve that she is not being believed and that her experiences are not\nvalidated. The benefits of such a provision would have in limiting the\nstrain imposed on child witness who are required to provide detailed\ntestimony about confusing, embarrassing and frightful incidents of abuse in\nan intimidating, confrontational and often hostile court room atmosphere.\nAnother advantage afforded by the Section is the opportunity for the child\nto answer delicate question about the abuse in a more controlled, less\nstressful and less hostile environment, a factor which according to social\nscience research, may drastically increase the likelihood of eliciting the\ntruth about the events at hand. The videotape testimony enables the Court\nto hear a more accurate account of what the child was saying about the\nincident at the time it first came to light and the videotape of an early\ninterview if used in evidence can supplement the evidence of a child who is\ninarticulate or forgetful at the trial. The Section also acts to remove the\npressure placed on a child victim of sexual assault when the attainment of\n&quot;truth&quot; depends entirely on her ability to control her fear, her shame and\nthe horror of being face to face with the accused when she must describe\nher abuse in a compelling and coherent manner. The Court also observed that\nthe rules of evidence have not been constitutionalised into unaltered\nprinciples of fundamental justice. Neither should they be interpreted in a\nrestrictive manner which may essentially defeat their purpose of seeking\ntruth and justice. Rules of evidence, as much as the law itself, are not\ncast in stone and will evolve with time. There Court accordingly reversed\nthe judgment of Court of Appeal and upheld the constitutionality of section\n715.1.\n</p>\n<p data-structure=\"Section\" id=\"p_50\">30. We will briefly refer to the statutory provisions governing the\nsituation. <a href=\"/doc/1151812/\" id=\"a_137\">Section 273</a> Cr.P.C. lays down that except as otherwise expressly\nprovided, all evidence taken in the course of the trial or other\nproceedings shall be taken in the presence of the accused, or when his\npersonal attendance is dispensed with, in the presence of his pleader. Sub-\nsection (1) of <a href=\"/doc/1134316/\" id=\"a_138\">Section 327</a> Cr.P.C. lays down that any Criminal Court\nenquiring into or trying any offence shall be deemed to be open Court to\nwhich the public generally may have access, so far as the same can\nconveniently contain them. Sub-section (2) of the same Sections says that\nnotwithstanding anything contained in sub-section (1) the inquiry into the\ntrial of rape or an offence under Section 376, Section 376-A, Section 376-\nB, Section 376-C or <a href=\"/doc/9545/\" id=\"a_139\">Section 376-D</a> of the Indian Penal Code shall be\nconducted in camera. Under the proviso to this sub-section the Presiding\nJudge may, if he thinks fit, or on an application made by either of the\nparties, allow any particular person to have access to, or be or remain in,\nthe room or building used by the court. It is rather surprising that the\nlegislature while incorporating sub-section (2) to Section 327 by amending\nAct 43 of 1983 failed to take note of offences under <a href=\"/doc/203036/\" id=\"a_140\">Section 354</a> and <a href=\"/doc/1836974/\" id=\"a_141\">377</a>\nIPC and omitted to mention the aforesaid provisions. Deposition of the\nvictims of offences under <a href=\"/doc/203036/\" id=\"a_142\">Section 354</a> and <a href=\"/doc/1836974/\" id=\"a_143\">377</a> IPC can at time be very\nembarrassing to them.\n</p>\n<p data-structure=\"Precedent\" id=\"p_51\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"560467\" id=\"span_9\">31.  The whole inquiry before a Court being to elicit the truth, it is\nabsolutely necessary that the victim or the witnesses are able to depose\nabout the entire incident in a free atmosphere without any embarrassment.\n<a href=\"/doc/1151812/\" id=\"a_144\">Section 273</a> Cr.P.C. merely requires the evidence to be taken in the\npresence of the accused. The Section, however, does not say that the\nevidence should be recorded in such a manner that the accused should have\nfull view of the victim or the witnesses. Recording of evidence by way of\nvideo conferencing vis-a-vis <a href=\"/doc/1151812/\" id=\"a_145\">Section 273</a> Cr.P.C. has been held to be\npermissible in a recent decision of this Court in <a href=\"/doc/560467/\" id=\"a_146\">State of Maharashtra v.\nDr. Praful B Desai</a>, [2003] 4 SCC 601. There is major difference between\nsubstantive provisions defining crimes and providing punishment for the\nsame and procedural enactment laying down the procedure of trial of such\noffences. Rules of procedure are hand-maiden of justice and are meant to\nadvance and not to obstruct the cause of justice. It is, therefore,\npermissible for the Court to expand or enlarge the meanings of such\nprovisions in order to elicit the truth and do justice with the parties.</span>\n</p>\n<p data-structure=\"Section\" id=\"p_52\">32. The mere sight of the accused may induce an element of extreme fear in\nthe mind of the victim or the witnesses or can put them in a state of\nshock. In such a situation he or she may not be able to give full details\nof the incident which may result in miscarriage of justice. Therefore, a\nscreen or some such arrangement can be made where the victim or witnesses\ndo not have to undergo the trauma of seeing the body or the face of the\naccused. Often the question put in cross-examination are purposely designed\nto embarrass or confuse the victims of rape and child abuse. The object is\nthat out of the feeling of shame or embarrassment, the victim may not speak\nout or give details of certain acts committed by the accused. It will,\ntherefore, be better if questions to be put by the accused in cross-\nexamination are given in writing to the Presiding Officer of the Court, who\nmay put the same to the victim or witnesses in a language which is not\nembarrassing. There can hardly be any objection to the other suggestion\ngiven by the petitioner that whenever a child or victim of rape is required\nto give testimony, sufficient breaks should be given as and when required.\nThe provisions of sub-section (2) of <a href=\"/doc/1134316/\" id=\"a_147\">Section 327</a> Cr.P.C. should also apply\nin inquiry or trial of offences under <a href=\"/doc/203036/\" id=\"a_148\">Section 354</a> and <a href=\"/doc/1836974/\" id=\"a_149\">377</a> IPC.\n</p>\n<p data-structure=\"Precedent\" id=\"p_53\">33. <span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1046545\" id=\"span_10\">In <a href=\"/doc/1046545/\" id=\"a_150\">State of Punjab v. Gurmit Singh</a>, [1996] 2 SCC 384 this Court had\nhighlighted the importance of provisions of Section 327(2) and (3) <a href=\"/doc/445276/\" id=\"a_151\">Cr.P.C</a>.\nand a direction was issued not to ignore the mandate of the aforesaid\nprovisions and to hold the trial of rape cases in camera. It was also\npointed out that such trial in camera would enable the victim of crime to\nbe a little comfortable and answer the questions with greater ease and\nthereby improve the quality of evidence of a prosecutrix because there she\nwould not be so hesitant or bashful to depose frankly as she may be in an\nopen court, under the gaze of the public. It was further directed that as\nfar as possible trial of such cases may be conducted by lady Judges\nwherever available so that the prosecutrix can make a statement with\ngreater ease and assist the court to properly discharge their duties,\nwithout allowing the truth to be sacrificed at the altar of rigid\ntechnicalities.</span>\n</p>\n<p data-structure=\"Conclusion\" id=\"p_54\">34.  The writ petition is accordingly disposed of with the following\ndirections :\n</p>\n<blockquote id=\"blockquote_45\">(1)    The provisions of sub-section (2) of <a href=\"/doc/1134316/\" id=\"a_152\">section 327</a> Cr.P.C. shall in\naddition to the offences mentioned in the sub-section would also apply in\ninquiry or trial offences under <a href=\"/doc/203036/\" id=\"a_153\">sections 354</a> and <a href=\"/doc/1836974/\" id=\"a_154\">377</a> IPC.\n</blockquote>\n<blockquote id=\"blockquote_46\">(2)     In holding trial of child sex abuse or rape :\n</blockquote>\n<blockquote id=\"blockquote_47\">(a) a screen or some such arrangements may be made where the victim or\nwitnesses (who may be equally vulnerable like the victim) do not see the\nbody or face of the accused;\n</blockquote>\n<blockquote id=\"blockquote_48\">(ii) the questions put in cross-examination on behalf of the accused, in so\nfar as they relate directly to the incident, should be given in writing to\nthe President Officer of the Court who may put them to the victim or\nwitnesses in a language which is clear and is not embarrassing;\n</blockquote>\n<blockquote id=\"blockquote_49\">(iii) the victim of child abuse or rape, while giving testimony in court,\nshould be allowed sufficient breaks as and when required.\n</blockquote>\n<p data-structure=\"Conclusion\" id=\"p_55\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1046545\" id=\"span_11\">These directions are in addition to those given in <a href=\"/doc/1046545/\" id=\"a_155\">State of Punjab v.\nGurmit Singh</a>.</span>\n</p>\n<p data-structure=\"Conclusion\" id=\"p_56\">35.  The suggestions made by the petitioners will advance the cause of\njustice and are in the larger interest of society. The cases of child abuse\nand rape are increasing at alarming speed and appropriate legislation in\nthis regard is, therefore, urgently required. We hope and trust that the\nParliament will give serious attention to the points highlighted by the\npetitioner and make appropriate legislation with all the promptness which\nit deserves.\n</p>\n<p data-structure=\"Conclusion\" id=\"p_57\">36. Before parting with the case, we must place it on record that Ms.\nMeenakshi Arora put in lot of efforts and hard labour in placing the\nrelevant material before the Court and argued the matter with commendable\nability.\n</p>\n<p data-structure=\"Conclusion\" id=\"p_58\">G.P. MATHUR, J. : For the reasons given in WP (Crl.) No. 33 of 1997 decided\ntoday. Special Leave Petitions are dismissed.\n</p>\n\n\n\n","numcites":44,"numcitedby":66,"docsource":"Supreme Court of India","citetid":1103956,"divtype":"judgments","relatedqs":[{"value":"section 377 of ipc","formInput":"section%20377%20of%20ipc"},{"value":"ipc sec 354","formInput":"ipc%20sec%20354"},{"value":"unnatural offences","formInput":"unnatural%20offences"},{"value":"child sexual abuse","formInput":"child%20sexual%20abuse"},{"value":"\"homosexual\"","formInput":"%22homosexual%22"},{"value":"rape ","formInput":"rape%20"},{"value":"section 377 of indian penal code","formInput":"section%20377%20of%20indian%20penal%20code"},{"value":"Section 273 crpc","formInput":"Section%20273%20crpc"},{"value":"section.377 ipc and section 354 ipc","formInput":"section.377%20ipc%20and%20section%20354%20ipc"},{"value":"carnal intercourse","formInput":"carnal%20intercourse"},{"value":"Finger in vagina  filter:  section 354","formInput":"Finger%20in%20vagina%20%20filter%3A%20%20section%20354"},{"value":"intercourse sexual","formInput":"intercourse%20sexual"},{"value":"section 375 ipc","formInput":"section%20375%20ipc"},{"value":"section 376 ipc","formInput":"section%20376%20ipc"},{"value":"indian penal code section 354","formInput":"indian%20penal%20code%20section%20354"},{"value":"section- 327 of code of criminal procedure ","formInput":"section-%20327%20of%20code%20of%20criminal%20procedure%20"},{"value":"child  abuse","formInput":"child%20%20abuse"},{"value":"section 273 criminal procedure code","formInput":"section%20273%20criminal%20procedure%20code"},{"value":"Finger in vagina  filter:  section 377 of ipc","formInput":"Finger%20in%20vagina%20%20filter%3A%20%20section%20377%20of%20ipc"},{"value":"stare decisis","formInput":"stare%20decisis"}],"cats":[{"value":"rape","formInput":"tag:rape"},{"value":"unnatural-offences","formInput":"tag:unnatural-offences"},{"value":"assault-on-woman","formInput":"tag:assault-on-woman"},{"value":"indian-penal-code","formInput":"tag:indian-penal-code"}],"courtcopy":true,"cites":[{"tid":623254,"title":"Section 375 in The Indian Penal Code, 1860"},{"tid":1836974,"title":"Section 377 in The Indian Penal Code, 1860"}],"citedby":[{"tid":97850168,"title":"Virender vs The State Of Nct Of Delhi on 18 September, 2009"},{"tid":142993966,"title":"198Th Report On Witness Identity Protection And Witness Protection Programmes"},{"tid":32457334,"title":"State vs Rahul on 15 April, 2013"}],"query_alert":null,"agreement":false}