{"tid":91871116,"publishdate":"2025-07-17","title":"Narpat Singh vs Bhanwar Singh (2025:Rj-Jd:31393) on 17 July, 2025","doc":"<h2 class=\"doc_title\">Narpat Singh vs Bhanwar Singh (2025:Rj-Jd:31393) on 17 July, 2025</h2>\n\n<pre id=\"pre_1\">[2025:RJ-JD:31393]\n\n\n\n      HIGH COURT OF JUDICATURE FOR RAJASTHAN AT\n                       JODHPUR\n                S.B. Civil Writ Petition No. 10690/2025\n\nNarpat Singh S/o Late Shri Bhawani Singh, Aged About 40 Years,\nResident Of Marudhar Keshri Nagar, Pataliya Janv, Sojat City\nTehsil Sojat, District Pali, Rajasthan.\n                                                                   ----Petitioner\n                                    Versus\nBhanwar Singh S/o Late Shri Bhawani Singh, R/o Kot Ka Mohalla,\nSojat City Tehsil Sojat, District Pali, Rajasthan. At Present\nManorat Stans, 15-2-155 Maharaj Gunj, Gowliguda, Hyderabad.\n                                                                 ----Respondent\n\n\n For Petitioner(s)          :    Mr. Himanshu Shrimali.\n For Respondent(s)          :\n\n         HON&#x27;BLE MR. JUSTICE ARUN MONGA</pre>\n<p data-structure=\"Issue\" id=\"p_1\">                   Order (Oral)\n17/07/2025\n\n</p><p data-structure=\"Issue\" id=\"p_2\">1.    The challenge in this petition pertains to an order dated\n\n18.10.2024 (Annex.6) passed by the learned Additional District\n\nJudge, Sojat City, Pali, in Civil Original Case No.5/2020, vide\n\nwhich, the application filed by the petitioner-plaintiff under Section\n\n60 of the Bharatiya Sakshya Adhiniyam, 2023 (inadvertently cited\n\nas <a href=\"/doc/487818/\" id=\"a_1\">Section 65</a> of the Indian Evidence Act, 1872 before the trial\n\ncourt), seeking to place a copy of the Will on record, was rejected.\n\n</p><p data-structure=\"Facts\" id=\"p_3\">2.    Case set up in the petition is that the petitioner-plaintiff filed\n\na suit against the respondent-defendant, seeking a declaration of\n\nownership over Plot No. 21 based on a Will dated 10.3.2009,\n\nexecuted by his father, along with a prayer for a perpetual\n\ninjunction. The plaintiff averred that the plot was owned by his\n\nfather, as evidenced by a patta issued by the Sojat Municipality\n\nvide allotment sale letter No. 68/2002-2003.\n</p>\n<p data-structure=\"Issue\" id=\"p_4\">\n<span class=\"hidden_text\" id=\"span_1\">                     (Downloaded on 21/07/2025 at 09:37:21 PM)</span>\n</p><p data-structure=\"Facts\" id=\"p_5\"> [2025:RJ-JD:31393]                     (2of 7)                     [CW-10690/2025]\n\n\n\n2.1. The plaintiff further averred that his brother, the defendant,\n\noperates a stationery shop in Hyderabad, established with\n\nfinancial assistance from their father, and resides there for\n\nbusiness purposes. The plaintiff&#x27;s parents resided with him. The\n\nplaintiff claimed that his father executed a duly notarized Will\n\ndated 10.3.2009 in his favor for the disputed plot. Following the\n\nfather&#x27;s death, the Will came into effect, but the defendant\n\nallegedly interfered with the plaintiff&#x27;s possession and threatened\n\nto evict him, prompting the filing of the suit.\n</p>\n<p data-structure=\"RespArg\" id=\"p_6\">2.2. The     defendant    filed    a     written      statement    denying    the\n\nplaintiff&#x27;s claims. He contended that, although the plot is in their\n\nfather&#x27;s name, he contributed Rs.50,000 toward its purchase and\n\nRs. 1,00,000 for the construction of the house, asserting that the\n\nproperty is not the father&#x27;s self-acquired property. The defendant\n\nfurther alleged that the plaintiff forged the Will dated 10.3.2009\n\nand claimed to have filed an FIR, which is under investigation.\n\n2.3. Based on the pleadings, the learned trial court framed the\n\nissues, and the plaintiff submitted his affidavit for examination-in-\n\nchief.\n</p>\n<p data-structure=\"Facts\" id=\"p_7\">2.4. The plaintiff filed an application under Order 11 Rule 12 and\n\n14 <a href=\"/doc/161831507/\" id=\"a_2\">CPC</a>, stating that the suit was at the evidence stage and that\n\nthe original patta of Plot No. 21 and the original Will dated\n\n10.3.2009 were in the defendant&#x27;s possession. The plaintiff\n\nrequested that these documents, critical to the suit, be summoned\n\nand placed on record.\n</p>\n<p data-structure=\"RespArg\" id=\"p_8\">2.5. On     21.2.2024,    the      learned       trial    court   dismissed   the\n\napplication, noting that the defendant denied possessing the\n\noriginal Will and had submitted an affidavit to that effect.\n\n<span class=\"hidden_text\" id=\"span_2\">                     (Downloaded on 21/07/2025 at 09:37:21 PM)</span>\n</p><p data-structure=\"RespArg\" id=\"p_9\"> [2025:RJ-JD:31393]                   (3of 7)                      [CW-10690/2025]\n\n\n\n2.6. On 28.8.2024, the plaintiff filed another application, this time\n\nunder <a href=\"/doc/487818/\" id=\"a_3\">Section 65</a> of the Indian Evidence Act, 1872 (inadvertently\n\ncited, as it should have been under <a href=\"/doc/1681167/\" id=\"a_4\">Section 60</a> of the Bharatiya\n\nSakshya Adhiniyam, 2023), requesting permission to mark a\n\nphotocopy of the Will dated 10.3.2009 as an exhibit and produce it\n\nas secondary evidence, as the original was allegedly in the\n\ndefendant&#x27;s possession. The plaintiff had submitted photocopies of\n\nall documents, including the Will, along with his affidavit.\n\n2.7. The defendant opposed this application, arguing that the\n\nplaintiff failed to provide details of the document, that a prior\n\napplication under Order 11 Rule 12 and 14 <a href=\"/doc/161831507/\" id=\"a_5\">CPC</a> was dismissed,\n\nand that the present application was filed to delay proceedings.\n\nThe defendant also reiterated that an FIR had been lodged for the\n\nalleged forged Will, though it was stayed by the Hon&#x27;ble High\n\nCourt.\n</p>\n<p data-structure=\"Issue\" id=\"p_10\">2.8. On 18.10.2024, the learned trial court                      dismissed the\n\nplaintiff&#x27;s application, holding that the earlier application for\n\nsummoning the original Will was dismissed, an FIR for the alleged\n\nforged Will was under investigation, and the plaintiff failed to\n\ndemonstrate whether the original document was lost or its\n\nwhereabouts. Consequently, the plaintiff has filed this writ petition\n\nchallenging the order dated 18.10.2024.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_11\">3.    In the aforesaid backdrop, I have heard learned counsel for\n\nthe petitioner and have perused the case file.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_12\">4.    Given the nature of order, which I proposed to pass, I do not\n\ndeem it necessary to issue notice to the respondent, as no\n\nprejudice would be caused to them by the nature of order which I\n\n\n\n\n<span class=\"hidden_text\" id=\"span_3\">                     (Downloaded on 21/07/2025 at 09:37:21 PM)</span>\n [2025:RJ-JD:31393]                       (4of 7)                        [CW-10690/2025]\n\n\n\npropose to pass. In any case, it will only further delay the trial\n\nproceedings.\n</p>\n<p data-structure=\"PetArg\" id=\"p_13\">5.      Learned counsel for the petitioner inter alia argues that the\n\nlearned trial court failed to consider that the petitioner explicitly\n\nstated that the original Will dated 10.3.2009 is in the power and\n\npossession of the respondent-defendant. In the absence of the\n\noriginal Will being summoned, the petitioner sought permission to\n\nproduce its photocopy as secondary evidence. However, the\n\nlearned trial court&#x27;s finding that the respondent denied possession\n\nof the original Will and that the petitioner failed to establish the\n\nbasis    for    secondary       evidence        is   misconceived       and    unjust,\n\nwarranting the quashing of the order dated 18.10.2024.\n\n5.1. He        further   argues       that     learned       trial   court   erred   in\n\noverlooking the fact that the suit is at the evidence stage, and the\n\nrefusal to admit the photocopy of the Will as secondary evidence\n\nseverely prejudices the petitioner&#x27;s case, potentially leading to the\n\ndismissal of the suit. The photocopy of the Will is critical to\n\nsubstantiate the petitioner&#x27;s claim of ownership over Plot No. 21,\n\nas pleaded in the plaint. The trial court&#x27;s failure to consider this\n\nnecessity and its summary dismissal of the application vide the\n\norder dated 18.10.2024 renders the order unsustainable and liable\n\nto be set aside.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_14\">6.      For ease of reference, English translation (as provided) of the\n\nrelevant part of impugned order dated 18.10.2024, is as below:\n\n</p><blockquote id=\"blockquote_1\">             &quot;After considering the arguments of both parties, the case file\n          was again carefully examined. In the present case, an earlier\n          order dated 21.02.2024 regarding the Will was passed rejecting\n          the plaintiff&#x27;s application, in which the defendant stated that the\n          Will is not in his possession. An affidavit was also filed, after\n          which permission has been sought to exhibit this Will under\n          <a href=\"/doc/487818/\" id=\"a_6\">Section 65</a> of the Evidence Act and other documents are also\n\n<span class=\"hidden_text\" id=\"span_4\">                         (Downloaded on 21/07/2025 at 09:37:21 PM)</span>\n [2025:RJ-JD:31393]                       (5of 7)                            [CW-10690/2025]\n\n\n           sought to be exhibited, but no description has been given in the\n           application about what these other documents are. Permission\n           has been sought only to exhibit the original Will as secondary\n           evidence, and the application to summon this original Will was\n           rejected by this court based on the defendant&#x27;s reply. A criminal\n           case is also registered regarding this document being forged,\n           which is pending investigation. It does not appear from the\n           record that this Will is with the defendant and he is deliberately\n           not producing it. It also does not appear that this document is\n           missing or lost, nor has it been stated in the application that this\n           document is missing or lost. This document is stated to have\n           been written in favor of plaintiff Narpatsingh, therefore the\n           plaintiff himself must explain where and with whom the original\n           document is. The plaintiff has also not stated that this document\n           is lost. The plaintiff is legally bound to produce this document,\n           not the defendant, because the defendant has registered a\n           criminal case against the plaintiff and the defendant has also not\n           accepted this document. The said case that the defendant has\n           registered against the plaintiff is 17/2018 Anwan Bhawarsing vs.\n           Narpatsingh, in which the application to summon the said\n           document from Bhawarsing was also rejected. In such\n           circumstances, granting permission for secondary evidence of\n           this document does not appear justified.\n</blockquote><blockquote id=\"blockquote_2\">               Therefore, the plaintiff&#x27;s said application under <a href=\"/doc/487818/\" id=\"a_7\">Section 65</a> of\n           the Evidence Act is rejected and dismissed. The case file for\n           plaintiff&#x27;s evidence is posted for 16/12/2024.&quot;\n</blockquote>\n\n<p data-structure=\"CDiscource\" id=\"p_15\">7.    Having perused the case file and order impugned, it appears\n\nthat the petitioner-plaintiff has taken all diligent steps to ensure\n\nthat relevant evidence is brought on record, which would aid not\n\nonly the learned trial court to unravel the truth but also in the\n\nproper adjudication of the dispute concerning the estate of Lt.\n\nBhawani Singh (father of the plaintiff and defendant, who are\n\nstated to be real brothers).\n</p>\n<p data-structure=\"RespArg\" id=\"p_16\">8.    Previously, an application under Order 11 Rule 12 &amp; 14 <a href=\"/doc/161831507/\" id=\"a_8\">CPC</a>\n\nwas filed seeking to summon the original Will from the defendant,\n\nspecifically requiring the defendant-respondent to produce the\n\noriginal Will on record, which the plaintiff has pleaded and seeks\n\nto rely upon, but which was allegedly in the possession of his\n\nbrother.     This    application       was      dismissed            vide   order   dated\n\n\n\n<span class=\"hidden_text\" id=\"span_5\">                         (Downloaded on 21/07/2025 at 09:37:21 PM)</span>\n [2025:RJ-JD:31393]                       (6of 7)                          [CW-10690/2025]\n\n\n\n21.02.2024, on the ground that the defendant denied possessing\n\nthe said Will, rendering the application without merit.\n\n</p><p data-structure=\"CDiscource\" id=\"p_17\">9.     Subsequently, the petitioner-plaintiff filed another application\n\non 28.08.2024 under <a href=\"/doc/1681167/\" id=\"a_9\">Section 60</a> of the Bharatiya Sakshya\n\nAdhiniyam, 2023 (though inadvertently citing old Act i.e. <a href=\"/doc/487818/\" id=\"a_10\">Section\n\n65</a> of the Indian Evidence Act in the application before the trial\n\ncourt), seeking to place on record a photocopy of the aforesaid\n\nWill. However, this application was dismissed vide order dated\n\n18.10.2024 (Annex.6) on the basis that the original Will was not\n\nproduced by the plaintiff.\n</p>\n<p data-structure=\"PetArg\" id=\"p_18\">10.    Be that as it may, the petitioner now contends that the\n\ndefendant has deliberately withheld or destroyed the said Will and\n\nasserts that the petitioner-plaintiff possesses a photocopy of the\n\nsame, which should be permitted to be adduced as secondary\n\nevidence on record.\n</p>\n<p data-structure=\"CDiscource\" id=\"p_19\">11.    Considering the entirety of the matter, I am of the opinion\n\nthat the onus of proving the Will (document in question) sought to\n\nbe adduced by the petitioner-plaintiff rests solely on him. Subject\n\nto    this,   if   the   petitioner-plaintiff         succeeds       in   proving    the\n\ndocument, it will assist the learned trial court in properly\n\nadjudicating the issues. Conversely, if the petitioner fails to prove\n\nthe document, no prejudice will be caused to the defendant.\n\n</p><p data-structure=\"Conclusion\" id=\"p_20\">12.    Accordingly, subject to the strict onus on the petitioner-\n\nplaintiff to prove the document sought to be adduced, and\n\npreserving the defendant&#x27;s right to object in accordance with the\n\nlaw, the petition is allowed.\n</p>\n<p data-structure=\"Conclusion\" id=\"p_21\">13.    The impugned order dated 18.10.2024 (Annex.6) is hereby\n\nset aside. The petitioner-plaintiff&#x27;s application under <a href=\"/doc/1681167/\" id=\"a_11\">Section 60</a> of\n\n<span class=\"hidden_text\" id=\"span_6\">                         (Downloaded on 21/07/2025 at 09:37:21 PM)</span>\n                                    [2025:RJ-JD:31393]                    (7of 7)                     [CW-10690/2025]\n\n\n\n                                   the Bharatiya Sakshya Adhiniyam, 2023 (though inadvertently\n\n                                   cited as <a href=\"/doc/487818/\" id=\"a_12\">Section 65</a> of the Indian Evidence Act before the trial\n\n                                   court), is allowed, and the photocopy of the Will is permitted to be\n\n                                   taken on record as secondary evidence.\n</p>\n<p data-structure=\"Conclusion\" id=\"p_22\">                                   14.   Pending application(s), if any, stand disposed of.\n\n\n\n</p><p data-structure=\"Conclusion\" id=\"p_23\">                                                                                                 (ARUN MONGA),J\n                                    16-Sumit/-\n</p>\n<p data-structure=\"Conclusion\" id=\"p_24\">\n</p><pre id=\"pre_2\">                                   Whether Fit for Reporting:-    Yes / No\n\n\n\n\n<span class=\"hidden_text\" id=\"span_7\">                                                         (Downloaded on 21/07/2025 at 09:37:21 PM)</span>\n\n\n\n\nPowered by TCPDF (www.tcpdf.org)\n </pre>","numcites":3,"numcitedby":0,"docsource":"Rajasthan High Court - Jodhpur","citetid":91871116,"divtype":"judgments","courtcopy":true,"cites":[{"tid":487818,"title":"Section 65 in The Indian Evidence Act, 1872"},{"tid":161831507,"title":"The Code of Civil Procedure, 1908"},{"tid":1681167,"title":"Section 60 in The Indian Evidence Act, 1872"}],"citedby":[],"query_alert":null,"agreement":false}