{"tid":96356448,"publishdate":"2004-05-26","title":"Sakshi vs Union Of India (Uoi) And Ors. on 26 May, 2004","doc":"<h2 class=\"doc_title\">Sakshi vs Union Of India (Uoi) And Ors. on 26 May, 2004</h2>\n\n<h3 class=\"doc_citations\">Equivalent citations: AIR2004SC3566, 2004(2)ALD(CRI)504, 2004(2)BLJR1378, 98(2004)CLT491(SC), 2004CRILJ2881, 112(2004)DLT457(SC), 2004(77)DRJ390, RLW2004(3)SC402, 2004(6)SCALE15, (2004)5SCC518, 2005(1)UJ37(SC), AIR 2004 SUPREME COURT 3566, 2004 (5) SCC 518, 2004 AIR SCW 3449, 2004 CALCRILR 910, (2004) 19 ALLINDCAS 1 (SC), 2004 (2) BLJR 1378, 2004 BLJR 2 1378, 2004 (19) ALLINDCAS 1, 2005 (1) UJ (SC) 37, 2005 UJ(SC) 1 37, 2004 CRI(AP)PR(SC) 479, 2004 (3) LRI 242, 2004 (6) ACE 117, 2004 CRILR(SC MAH GUJ) 755, 2004 (4) SLT 676, 2004 (6) SCALE 15, 2004 SCC(CRI) 1645, (2004) 77 DRJ 390, (2004) 3 EASTCRIC 43, (2004) 2 ORISSA LR 239, (2004) 3 RAJ CRI C 757, (2004) 3 RAJ LW 402, (2004) 3 RECCRIR 702, (2004) 5 SUPREME 68, (2005) 2 ALLCRIR 1537, (2004) 6 SCALE 15, (2005) 2 GCD 970 (SC), (2004) 3 CRIMES 177, (2004) 112 DLT 457, (2004) 2 BLJ 648, (2004) 49 ALLCRIC 680, (2004) 4 ALLCRILR 184, 2005 CHANDLR(CIV&CRI) 153, (2004) 28 OCR 704, 2004 (2) ALD(CRL) 504</h3>\n\n<h3 class=\"doc_author\">Author: <a href=\"/search/?formInput=authorid:g-p-mathur\">G.P. Mathur</a></h3>\n\n<h3 class=\"doc_bench\">Bench: <a href=\"/search/?formInput=benchid:s-r-babu\">S. Rajendra Babu</a>, <a href=\"/search/?formInput=benchid:g-p-mathur\">G.P. Mathur</a></h3>\n\n<pre id=\"pre_1\">JUDGMENT\n \n\n G.P. Mathur, J.  \n \n\n</pre><p data-structure=\"Issue\" id=\"p_1\">1. This writ petition under <a href=\"/doc/981147/\" id=\"a_1\">Article 32</a> of the Constitution has been filed by way of public interest litigation, by Sakshi, which is an organisation to provide legal, medical, residential, psychological or any other help, assistance or charitable support for women, in particular those who are victims of any kind of sexual abuse and/or harassment, violence or any kind of atrocity or violation and is a violence intervention center. The respondents arrayed in the writ petition are (1) Union of India; (2) Ministry of Law and Justice; and (3) Commissioner of Police, New Delhi. The main reliefs claimed in the writ petition arc as under :\n</p>   \n\n<blockquote id=\"blockquote_1\">A) Issue a writ in the nature of a declaration or any other appropriate writ or direction declaring inter alia that &quot;sexual intercourse&quot; as contained in <a href=\"/doc/623254/\" id=\"a_2\">Section 375</a> of the Indian Penal Code shall include all forms of penetration such as penile/vaginal penetration, penile/oral penetration, penile/anal penetration, finger/vaginal and finger/anal penetration and object/vaginal penetration;\n</blockquote> \n\n<blockquote id=\"blockquote_2\">B) Consequently, issue a writ, order or direction in the nature of a direction to the respondents and its servants and agents to register all such cases found to be truly on investigation, offences falling within the broadened interpretation of &quot;sexual intercourse&quot; set out in prayer (A) aforesaid as offences under <a href=\"/doc/623254/\" id=\"a_3\">Section 375</a>, <a href=\"/doc/1279834/\" id=\"a_4\">376</a> and <a href=\"/doc/668689/\" id=\"a_5\">376A</a> to <a href=\"/doc/9545/\" id=\"a_6\">376D</a> of the Indian Penal Code, 1860;\n</blockquote> \n\n<blockquote id=\"blockquote_3\">C) Issue such other writ order or direction as this Hon&#x27;ble Court may deem appropriate in the present facts and circumstances. \n</blockquote> \n\n<p data-structure=\"Issue\" id=\"p_2\">The petition is thus restricted to a declaratory relief and consequential directions.\n</p> \n\n<p data-structure=\"Section\" id=\"p_3\">2. It is set out in the writ petition that the petitioner has noticed with growing concern the dramatic increase of violence, in particular sexual violence against women and children as well as the implementation of the provisions of <a href=\"/doc/1569253/\" id=\"a_7\">Indian Penal Code</a> namely <a href=\"/doc/1836974/\" id=\"a_8\">Sections 377</a>, <a href=\"/doc/623254/\" id=\"a_9\">375</a>/<a href=\"/doc/1279834/\" id=\"a_10\">376</a> and <a href=\"/doc/203036/\" id=\"a_11\">354</a> by the respondent authorities. The existing trend of the respondent authorities has been to treat sexual violence, other than penile/vaginal penetration, as lesser offences falling under either <a href=\"/doc/1836974/\" id=\"a_12\">Section 377</a> or 354 of the <a href=\"/doc/1569253/\" id=\"a_13\">IPC</a> and not as a sexual offence under <a href=\"/doc/623254/\" id=\"a_14\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_15\">376</a> IPC. It has been found that offences such as sexual abuse of minor children and women by penetration other than penile/vaginal penetration, which would take any other form and could also be through use of objects whose impact on the victims is in no manner less than the trauma of penile/vaginal penetration as traditionally understood under <a href=\"/doc/623254/\" id=\"a_16\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_17\">376</a>, have been treated as offences tailing under <a href=\"/doc/203036/\" id=\"a_18\">Section 354</a> of the IPC as outraging the modesty of a women or under <a href=\"/doc/1836974/\" id=\"a_19\">Section 377</a> IPC as unnatural offenses.\n</p> \n\n<p data-structure=\"PetArg\" id=\"p_4\">3. The petitioner through the present petition contends that the narrow understanding and application of rape under <a href=\"/doc/623254/\" id=\"a_20\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_21\">376</a> IPC only to the cases of penile/vaginal penetration runs contrary to the existing contemporary understanding of rape as an intent to humiliate, violate and degrade a woman or child sexually and, therefore, adversely affects the sexual integrity and autonomy of women and children in violation of <a href=\"/doc/1199182/\" id=\"a_22\">Article 21</a> of the Constitution.\n</p> \n\n<p data-structure=\"Section\" id=\"p_5\">4. The petitioner submits that a plain reading of <a href=\"/doc/623254/\" id=\"a_23\">Section 375</a> would make it apparent that the term &quot;sexual intercourse&quot; has not been defined and is, therefore, subject to and is capable of judicial interpretation. Further the explanation to <a href=\"/doc/623254/\" id=\"a_24\">Section 375</a> IPC does not in any way limit the term penetration to mean penile/vaginal penetration. The definition of the term rape as contained in the Code is extremely wide and takes within its sweep various forms of sexual offenses. Limiting the understanding of &quot;rape&quot; to abuse by penile/vaginal penetration only, runs contrary to the contemporary understanding of sexual abuse law and denies majority of women and children access to adequate redress in violation of <a href=\"/doc/367586/\" id=\"a_25\">Article 14</a> and <a href=\"/doc/1199182/\" id=\"a_26\">21</a> of the Constitution. Statistics and figures indicate that sexual abuse of children, particularly minor girl, children by means and manner other than penile/vaginal penetration is common and may take the form of penile/anal penetration, penile/oral penetration, finger/vaginal penetration or object/ vaginal penetration. It is submitted that by treating such forms of abuse as offenses falling under <a href=\"/doc/203036/\" id=\"a_27\">Section 354</a> IPC or 377 <a href=\"/doc/1569253/\" id=\"a_28\">IPC</a>, the very intent of the amendment of <a href=\"/doc/1279834/\" id=\"a_29\">Section 376</a> IPC by incorporating Sub-<a href=\"/doc/915147/\" id=\"a_30\">section 2(f)</a> therein is defeated. The said interpretation is also contrary to the contemporary understanding of sexual abuse and violence all over the world.\n</p> \n\n<p data-structure=\"PetArg\" id=\"p_6\">5. The petitioner submits that mere has for some time now been a growing body of feminist legal theory and jurisprudence which has clearly established rape as an experience of humiliation, degradation and violation rather than an outdated notion of penile/vaginal penetration. Restricting an understanding of rape in terms sought to be done by the respondent authorities and its agents reaffirms the view that rapists treat rape as sex and not violence and thereby condone such behavior especially when it comes to sexual abuse of children.\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_7\">6. In this regard, reference is invited to the observations of a renowned expert on the issue of sexual abuse :\n</p><blockquote id=\"blockquote_4\"> &quot;....... in rape .... the intent is not merely to &quot;take&quot;, but to humiliate and degrade ..... Sexual assault in our day and age is hardly restricted to forced genital copulation, nor is it exclusively a male-on-female offence. Tradition and biologic opportunity have rendered vaginal rape a particular political crime with a particular political history, but the invasion may occur through the mouth or the rectum as well. And while the penis may remain the rapist&#x27;s favourite weapon, his prime instrument of vengeance...... it is not in fact his only tool. Sticks, bottles and even fingers are often substituted for the &quot;natural&quot; thing. And as men may invade women through other offices, so too, do they invade other men. Who is to say that the sexual humiliation suffered through forced oral or rectal penetration is a lesser violation of the personal, private inner space, a lesser injury to mind, spirit and sense of self ?&quot; (Susan Brownmiller,  Against Our Will 1986). \n</blockquote> \n\n<p data-structure=\"Section\" id=\"p_8\">7. The petitioner further submits that the respondent authorities and their agents have failed to take into consideration the legislative purpose of <a href=\"/doc/1836974/\" id=\"a_31\">Section 377</a> IPC. Reference has also been made to The Law Commission of India Report (No. 42) of 1971 pp. 281. While considering whether or not to retain <a href=\"/doc/1836974/\" id=\"a_32\">Section 377</a> IPC, the Commission found as under :\n</p><blockquote id=\"blockquote_5\"> &quot;There are, however, a few sound reasons for retaining the existing law in India. First it cannot be disputed that homosexual acts and tendencies on the pan of one spouse may affect the married life and happiness of the other spouse, and from this point of view, making the acts punishable by law has social justification. Secondly, even assuming that acts done in private with consent do not in themselves constitute a serious evil, there is a risk involved in repealing legislation which has been in force for a long time........ Ultimately, the answer to the question whether homosexual acts ought to be punished depends on the view one takes of the relationship of criminal law to morals. .... We are inclined to think that Indian society, by and large, disapproves of homosexuality and this disapproval is strong enough to justify it being treated as a criminal offence even where adults indulge in it in private.&quot;\n</blockquote> \n\n<p data-structure=\"CDiscource\" id=\"p_9\">In view of the Commission&#x27;s conclusions regarding the purview of <a href=\"/doc/1836974/\" id=\"a_33\">Section 377</a> IPC, the said section was clearly intended to punish certain forms of private sexual relations perceived as immoral. Despite the same, the petitioner submits, the respondent authorities have, without any justification, registered those cases of sexual violence which would otherwise fall within the scope and ambit of <a href=\"/doc/623254/\" id=\"a_34\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_35\">376</a> IPC, as cases of moral turpitude under <a href=\"/doc/1836974/\" id=\"a_36\">Section 377</a> IPC. It is submitted that the respondent authorities and their agents have wrongly strained the language of <a href=\"/doc/1836974/\" id=\"a_37\">Section 377</a> IPC intended to punish &quot;homosexual&quot; behavior to punish more serious cases of sexual violence against women and children when the same ought to be dealt with as sexual offences within the meaning of <a href=\"/doc/623254/\" id=\"a_38\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_39\">376</a> IPC in violation of <a href=\"/doc/367586/\" id=\"a_40\">Articles 14</a> and <a href=\"/doc/1199182/\" id=\"a_41\">21</a> of the Constitution of India.\n</p> \n\n<p data-structure=\"RespArg\" id=\"p_10\">8. It is submitted that <a href=\"/doc/1603957/\" id=\"a_42\">Article 15(3)</a> of the Constitution of India allows for the State to make special provision for women and children. It follows that &quot;special provision&quot; necessarily implies &quot;adequate&quot; provision. Further, that the arbitrary and narrow interpretation sought to be placed by the respondent authorities and their agents on <a href=\"/doc/623254/\" id=\"a_43\">Section 375</a>/<a href=\"/doc/1279834/\" id=\"a_44\">376</a> renders the effectiveness of redress under the said Sections and in particular under <a href=\"/doc/334057/\" id=\"a_45\">Section 376(2)(f)</a> meaningless in violation of <a href=\"/doc/1603957/\" id=\"a_46\">Article 15(3)</a> of the Constitution of India. The petitioner has also referred to the U.N. Right of Child Convention ratified by the respondent No. 1 on 11th December, 1993 as well as the U.N. Convention on the Elimination of Discrimination Against Women which was ratified in August 1993. In view of the ratification, the respondent No. 1 has created a legitimate expectation that it shall adhere to its International commitments as set out under the respective Conventions. In the present case, however, the existing interpretation of rape sought to be imposed by the respondent authorities and their agents is in complete violation of such International commitments as have been upheld by this Court.\n</p> \n\n<p data-structure=\"Issue\" id=\"p_11\">9. By an order passed on 3.11.2000 the parties were directed to formulate issues which arise for consideration. Accordingly, the petitioner has submitted the following issues and legal propositions which require consideration by the Court :\n</p>   \n\n<blockquote id=\"blockquote_6\">(a) Given that modem feminist legal theory and jurisprudence look at rape as an experience of humiliation, degradation and violation rather than an outdated notion of penile/vaginal penetration, whether the term &quot;rape&quot; should today be understood to include not only forcible penile/vaginal penetration but all forms of forcible penetration including penile/oral penetration, penile/anal penetration, object or finger/vaginal and object or finger/anal penetration.\n</blockquote> \n\n<blockquote id=\"blockquote_7\">(b) Whether all forms of non-consensual penetration should not be subsumed under <a href=\"/doc/530949/\" id=\"a_47\">Section 373</a> of the Indian Penal code and the same should not be limited to penile, vaginal penetration only.\n</blockquote> \n\n<blockquote id=\"blockquote_8\">(c) In particular, given the widespread prevalence of child sexual abuse and bearing in mind the provisions of the <a href=\"/doc/1732853/\" id=\"a_48\">Criminal Law (Amendment) Act, 1983</a> which specifically inserted Section 376(2)(f) envisaging the offence of &quot;rape&quot; of a girl child howsoever young below 12 years of age, whether the expression &quot;sexual intercourse&quot; as contained in <a href=\"/doc/623254/\" id=\"a_49\">Section 375</a> of the Indian Penal Code should correspondingly include all forms of penetration such as penile/vaginal penetration, penile/oral penetration, penile/anal penetration, finger/vagina and finger/anal penetration and object/vaginal penetration; and whether the expression &quot;penetration&quot; should not be so clarified in the Explanation to <a href=\"/doc/623254/\" id=\"a_50\">Section 375</a> of the Indian Penal Code.\n</blockquote> \n\n<blockquote id=\"blockquote_9\">(d) Whether a restrictive interpretation of &quot;penetration&quot; in the Explanation to Section 375 (rape) defeats the very purpose and intent of the provision for punishment for rape under Section 376(2)(f) &quot;Whosoever commits rape on a woman when she is under twelve years of age.&quot;\n</blockquote> \n\n<blockquote id=\"blockquote_10\">(e) Whether, penetration abuse of a child below the age of 12 should no longer be arbitrarily classified according to the &#x27;type&#x27; of penetration (ignoring the &#x27;impact&#x27; on such child) either as an &quot;unnatural offence&quot; under <a href=\"/doc/1836974/\" id=\"a_51\">Section 377</a> IPC for penile/oral penetration and penile/anal penetration or otherwise as &quot;outraging the modesty of a woman&quot; under Section 354 for finger penetration or penetration with an inanimate object.\n</blockquote> \n\n<blockquote id=\"blockquote_11\">(f) Whether non-consensual penetration of a child under the age of 12 should continue to be considered as offences under Section 377 (&quot;Unnatural Offences&quot;) on par with certain forms of consensual penetration (such as consensual homosexual sex) where a consenting party can be held liable as an abettor or otherwise.\n</blockquote> \n\n<blockquote id=\"blockquote_12\">(g) Whether a purposive/teleological interpretation of &quot;rape&quot; under Section 375/376 requires taking into account the historical disadvantage faced by a particular group (in the present case, women and children) to show that the existing restrictive interpretation worsens that disadvantage and for that reason fails the test of equality within the meaning of <a href=\"/doc/367586/\" id=\"a_52\">Article 14</a> of the Constitution of India.\n</blockquote> \n\n<blockquote id=\"blockquote_13\">(h) Whether the. present narrow interpretation treating only eases of penile/vaginal penetration as rape, adversely affects the sexual integrity and autonomy of women and children in violation of <a href=\"/doc/1199182/\" id=\"a_53\">Article 21</a> of Constitution of India. \n</blockquote> \n\n<p data-structure=\"Section\" id=\"p_12\">10. Counter affidavit on behalf of respondents No. 1 and 2 has been filed by Mrs. G. Mukerjee. Director in the Ministry of Home Affairs. It is stated therein that Sections 375 and 376 have been substantially changed by the <a href=\"/doc/1732853/\" id=\"a_54\">Criminal Law (Amendment) Act, 1983</a>. The same Act has also introduced several new Sections viz. 376A, 376B, 376C and 376D <a href=\"/doc/1569253/\" id=\"a_55\">IPC</a>. These sections have bean inserted with a view to provide special/adequate provisions for women and children. The term &quot;rape&quot; has been clearly defined under <a href=\"/doc/623254/\" id=\"a_56\">Section 375</a> IPC. Penetration other than penile/vaginal penetration are unnatural sexual offences. Stringent punishments are provided for such unnatural offences under Section 377. The punishment provided under Section 377 is imprisonment for life or imprisonment of either description for a term which may extend to 10 years and shall also be liable to fine. Section 377 deals with unnatural offences and provides for a punishment as severe as that provided for rape in Section 376. Section 354 and 506 have been framed with a view to punish lesser offence of criminal assault in the form of outraging the modesty of a woman, whereas Sections 376 and 377 provide stringent punishment for sexual offences. The types of several offences as mentioned by the petitioner i.e. penile/anus penetration, penile/oral penetration, finger/anile penetration, finger/vaginal penetration or object/vaginal penetration are serious sexual offences of unnatural nature and are to be covered under Section 377 which provides stringent punishment. Therefore, the plea of petitioner that offences under Section 377 are treated as lesser offences is incorrect. It is also submitted in the counter affidavit that penetration of the vagina, anus or urethra of any person with any part of the body of another person other than penile penetration is considered to be unnatural and has to be dealt with under <a href=\"/doc/1836974/\" id=\"a_57\">Section 377</a> IPC. Section 376(2)(f) provides stringent punishment for committing rape on a woman when she is under the age of 12 years. Child sexual abuse of any nature, other than penile penetration, is obviously unnatural and are to be dealt with under <a href=\"/doc/1836974/\" id=\"a_58\">Section 377</a> IPC. It is further submitted that <a href=\"/doc/203036/\" id=\"a_59\">Section 354</a> IPC provides for punishment for assault or criminal force to woman to outrage her modesty. Unnatural sexual offences can not be brought under the ambit of this Section. Rape defined under Section 375 is penile/vaginal penetration and all other sorts of penetration are considered to be unnatural sexual offences. Section 377 provides stringent punishment for such offences. It is denied that provisions of Sections 375, 376 and 377 are violative of fundamental rights, under <a href=\"/doc/367586/\" id=\"a_60\">Articles 14</a><a href=\"/doc/1603957/\" id=\"a_61\">, 15(3)</a> and <a href=\"/doc/1199182/\" id=\"a_62\">21</a> of the Constitution of India. Sexual penetration as penile/anal penetration, finger/vaginal and finger/anal penetration and object and vaginal penetration are most unnatural forms of perverted sexual behavior for which Section 377 provides stringent punishment.\n</p> \n\n<p data-structure=\"Section\" id=\"p_13\">11. Ms. Meenakshi Arora, learned counsel for the petitioner has submitted that <a href=\"/doc/1569253/\" id=\"a_63\">Indian Penal Code</a> has to be interpreted in the light of the problems of present day and a purposive interpretation has to be given. She has submitted that <a href=\"/doc/623254/\" id=\"a_64\">Section 375</a> IPC should be interpreted in the current scenario, especially in regard to the fact that child abuse has assumed alarming proportion in recent times. Learned counsel has stressed that the words &quot;sexual intercourse&quot; in <a href=\"/doc/623254/\" id=\"a_65\">Section 375</a> IPC should be interpreted to mean all kinds of sexual penetration of any type of any orifice of the body and not the intercourse understood in the traditional sense. The words &quot;sexual intercourse&quot; having not been defined in the Penal Code, there is no impediment in the way of the Court to give it a wider meaning so that the various types of child abuse may come within its ambit and the conviction of an offender may be possible under <a href=\"/doc/1279834/\" id=\"a_66\">Section 376</a> IPC, In this connection, she has referred to United Nations Convention On The Elimination Of All Forms Of Discrimination Against Women, 1979 and also Convention On The Rights Of The Child adopted by the General Assembly of the United Nations on 20th February, 1989 and especially to <a href=\"/doc/1987997/\" id=\"a_67\">Articles 17(e)</a> and <a href=\"/doc/1218090/\" id=\"a_68\">19</a> thereof, which read as under :\n</p>   \n\n<blockquote id=\"blockquote_14\"><a href=\"/doc/1987997/\" id=\"a_69\">Article 17</a>\n \n\nStates Parties recognise the important function performed by the mass media and shall ensure that the child has access to information and material from a diversity of national and international sources, especially those aimed at the promotion of his or her social, spiritual and moral well-being and physical and mental health. To this end, States Parties shall --\n</blockquote>   \n\n<blockquote id=\"blockquote_15\">(a) ................. (Omitted as not relevant)\n \n\n</blockquote><blockquote id=\"blockquote_16\">(e) Encourage the development of appropriate guidelines for the protection of the child from information and material injurious to his or her well-being, bearing in mind the provisions of <a href=\"/doc/134715/\" id=\"a_70\">Articles 13</a> and <a href=\"/doc/1163710/\" id=\"a_71\">18.</a>\n</blockquote> \n\n<p data-structure=\"Section\" id=\"p_14\"><a href=\"/doc/1218090/\" id=\"a_72\">ARTICLE 19</a>\n \n\n</p><p data-structure=\"Section\" id=\"p_15\">1. States Parties shall take all appropriate legislative, administrative, social and educational measures to protect the child from all forms of physical and mental violence, injury or abuse, neglect or negligent treatment maltreatment or exploitation including sexual abuse, while in the care of parent(s), legal guardian(s) or any other persons who has the care of the child.\n</p> \n\n<p data-structure=\"PetArg\" id=\"p_16\">2. Such protective measures should, as appropriate, include effective procedures for the establishment of social programmes to provide necessary support for the child and for those who have the care of the child, as well as for other forms of prevention and for identification, reporting, referral, investigation, treatment and follow-up of instances of child maltreatment described heretofore, and, as appropriate, for judicial involvement. \n</p> \n\n<p data-structure=\"Precedent\" id=\"p_17\">12. In support of her submission, learned counsel has referred to following passage of statutory interpretation by F.A.R. Bennion (Butterworths -- 1984) at page 355-357 :\n</p>  \n\n<blockquote id=\"blockquote_17\"> &quot;While it remains law, an Act is to be treated as always speaking. In its application on any date, the language of the Act, though necessarily embedded in its own time, is nevertheless to be construed in accordance with the need to treat it as current law.\n</blockquote> \n\n<blockquote id=\"blockquote_18\">It is presumed that Parliament intends the Court to apply to an ongoing Act a construction that continuously updates its wording to allow for changes since the Act was initially framed.\n</blockquote> \n\n<blockquote id=\"blockquote_19\">In particular where, owing to developments occurring since the original passing of an enactment, a counter-mischief comes into existence or increases, it is presumed that Parliament intends the Court so to construe the enactment as to minimise the adverse effects of the counter-mischief.\n</blockquote> \n\n<blockquote id=\"blockquote_20\">The ongoing Act. In construing an ongoing Act, the interpreter is to presume that Parliament intended the Act to be applied at any future time in such a way as to give effect to the true original intention. Accordingly, the interpreter is to make allowances for any relevant changes that have occurred, since the Act&#x27;s passing, in law, social conditions, technology, the meaning of words, and other matters.\n</blockquote> \n\n<blockquote id=\"blockquote_21\">An enactment of former days is thus to be read today, in the light of dynamic processing received over the years, with such modification of the current meaning of its language as will now give effect to the original legislative intention. The reality and effect of dynamic processing provides the gradual adjustment. It is constituted by judicial interpretation, year in and year out. It also comprises processing by executive officials.&quot; \n</blockquote> \n\n<p data-structure=\"Precedent\" id=\"p_18\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1213429\" id=\"span_1\">In this connection, she has also referred to <a href=\"/doc/1213429/\" id=\"a_73\">S. Gopal Reddy v. State of A.P.</a>  where the Court referred to the following words of Lord Denning in Seaford Court Estates Ltd. v. Asher (1949) 2 All ER 153 :</span>\n</p><blockquote id=\"blockquote_22\"> &quot;............... It would certainly save the Judges trouble if Acts of Parliament were drafted with divine prescience and perfect clarity. In the absence of it, when a detect appears a Judge cannot simply fold his hands and blame the draftsman. He must set to work on the constructive task of finding the intention of Parliament, and he must do this not only from the language of the statute, bat also from a consideration of the social conditions which gave rise to it and of the mischief which it was passed to remedy, and then he must supplement the written word so as to give &#x27;force and life&#x27; to the intention of the legislature ....... A Judge should ask himself the question how, if the makers of the Act had themselves come across this ruck in the texture of it, they would have straightened it out ? He must then do as they would have done. A Judge must not alter the material of which the Act is woven, but he can and should iron out the creases.&quot;\n</blockquote> \n\n<p data-structure=\"Section\" id=\"p_19\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1013766\" id=\"span_2\">And held that it is a well known rule of interpretation of Statutes that the text and the context of the entire Act must be looked into while interpreting any of the expressions used in a Statute and that the Courts must look to the object which the Statute seeks to achieve while interpreting any of the provisions of the Act and a purposive approach is necessary. Accordingly, the words &quot;at or before or after the marriage as consideration for the marriage&quot; occurring in <a href=\"/doc/1249134/\" id=\"a_74\">Section 2</a> of the Dowry Prohibition Act were interpreted to mean demand of dowry at the &quot;negotiation stage&quot; as a consideration for proposed marriage and &quot;marriage&quot; was held to include the &quot;proposed marriage&quot; that may not have taken place. Reference is also made to <a href=\"/doc/1013766/\" id=\"a_75\">Directorate of Enforcement v. Deepak Mahajan and Anr.</a> , wherein it was held that a mere mechanical interpretation of the words devoid of concept or purpose will reduce most of legislation to futility and that it is a salutary rule, well established, that the intention of the legislature must be found by reading the Statute as a whole. Accordingly, certain provisions of <a href=\"/doc/600757/\" id=\"a_76\">FERA and Customs Act</a> were interpreted keeping in mind that the said enactments were enacted for the economic development of the country and augmentation of revenue. The Court did not accept the literal interpretation suggested by the respondent therein and held that Sub-section (1) and (2) of <a href=\"/doc/1687975/\" id=\"a_77\">Section 167</a> Cr.P.C. are squarely applicable with regard to the production and detention of a person arrested under the provisions of Section 35 of FERA and <a href=\"/doc/1771476/\" id=\"a_78\">Section 104</a> of Customs Act and that a Magistrate has jurisdiction under <a href=\"/doc/839149/\" id=\"a_79\">Section 167(2)</a> Cr.P.C. to authorize detention of a person arrested by an authorised officer of the Enforcement Directorate under FERA and taken to the Magistrate in compliance of Section 35(2) of FERA.</span>\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_20\"><span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"1353689\" id=\"span_3\">13. Ms. Meenakshi Arora has submitted that this purposive approach is being adopted in some of other countries so that the criminals do not go unscathed on mere technicality of law. She has placed strong reliance on some decisions of House of Lords to substantiate her contentions and the most notable being <a href=\"/doc/1353689/\" id=\"a_80\">R v. R</a> (1991) 4 All ER 481 where it was held as under :</span>\n</p><blockquote id=\"blockquote_23\"> &quot;The rule that a husband cannot be criminally liable for raping his wife if he has sexual intercourse with her without her consent no longer forms part of the law of England since a husband and wife are now to be regarded as equal partners in marriage and it is unacceptable that by marriage the wife submits herself irrevocably to sexual intercourse in all circumstances or that it is an incident of modern marriage that the wife consents to intercourse in all circumstances, including sexual intercourse obtained only by force. In Section 1(1) of the Sexual Offences (Amendment) Act, 1976, which defines rape as having &#x27;unlawful&#x27; intercourse with a woman without her consent, the word &#x27;unlawful&#x27; is to be treated as mere surplusage and not as meaning &#x27;outside marriage&#x27;, since it is clearly unlawful to have sexual intercourse with any woman without her consent.&quot;\n</blockquote> \n\n<p data-structure=\"Precedent\" id=\"p_21\">The other decision cited by learned counsel is Regina v. Burstow and Regina v. Ireland 1997 (4) All ER 74 where a person accused of repeated silent telephone calls accompanied on occasions by heavy breathing to women was held guilty of causing psychiatric injury amounting to bodily harm under Section 42 of Offences against the Person Act, 1861. In the course of the discussion, Lord Steyn observed that the criminal law has moved on in the light of a developing understanding of the link between the body and psychiatric injury and as a matter of current usage, the contextual interpretation of &quot;inflict&quot; can embrace the idea of one person inflicting psychiatric injury on another. It was further observed that the interpretation and approach should, so far as possible, be adopted which treats the ladder of offences as a coherent body of law. Learned counsel has laid emphasis on the following passage in the judgment :\n</p><blockquote id=\"blockquote_24\"> &quot;The proposition that the Victorian, legislator when enacting <a href=\"/doc/1732853/\" id=\"a_81\">Sections 18</a>, <a href=\"/doc/1732853/\" id=\"a_82\">20</a> and <a href=\"/doc/1732853/\" id=\"a_83\">47</a> of the Act 1861, would not have had in mind psychiatric illness is no doubt correct. Psychiatry was in its infancy in 1861. But the subjective intention of the draftsman is immaterial. The only relevant enquiry is as to the sense of the words in the context in which they are used. Moreover the Act of 1861 is a statute of the &quot;always speaking&quot; type : the statute must be interpreted in the light of the best current scientific appreciation of the link between the body and psychiatric injury.&quot;\n</blockquote> \n\n<p data-structure=\"Section\" id=\"p_22\">It has thus been contended that the words &quot;sexual intercourse&quot; occurring in <a href=\"/doc/623254/\" id=\"a_84\">Section 375</a> IPC must be given a larger meaning than as traditionally understood having regard to the monstrous proportion in which the cases of child abuse have increased in recent times. She has also referred to a decision of Constitutional Court of South Africa in the National Coalition for Gay and Lesbian Equality and Ors. v. The Minister of Home Affairs and Ors. -- Case CCT 10/99 wherein it was held that Section 25(5) of the Aliens Control Act 96 of 1991, by omitting to confer on persons, who are partners in permanent same sex life partnerships, the benefits it extends to spouses, unfairly discriminates, on the grounds of their sexual orientation and marital status, against partners in such same-sex partnerships who are permanently and lawfully resident in the Republic. Such unfair discrimination limits the equality rights of such partners guaranteed to them by <a href=\"/doc/16904705/\" id=\"a_85\">Section 9</a> of the Constitution and their right to dignity under Section 10. It was further held that it would not be an appropriate remedy to declare the whole of Section 25(5) invalid. Instead, it would be appropriate to read in, after the word &quot;spouse&quot; in the section, the words &quot;or partner, in a permanent same-sex life partnership&quot;.\n</p> \n\n<p data-structure=\"CDiscource\" id=\"p_23\">14. Ms. Meenakshi Arora has also placed before the Court the judgments rendered on 10th December, 1998 and 22nd  February, 2001 by the International Tribunal for the Prosecution of Persons Responsible for Serious Violations of International Humanitarian Law Committed in the Territory of the Former Yugoslavia since 1991. Under <a href=\"/doc/1937835/\" id=\"a_86\">Article 5</a> of the Statute of the International Tribunal, rape is a crime against humanity. Rape may also amount to a grave breach of the Geneva Conventions, a violation of the laws or customs of the war or an act of genocide, if the requisite elements are met and may be prosecuted accordingly. The Trial Chamber after taking note of the fact that no definition of rape can be found in international law, proceeded on the following basis :\n</p>  \n\n<blockquote id=\"blockquote_25\"> &quot;Thus, the Trial Chamber finds that the following may be accepted as the objective elements of rape :\n</blockquote>   \n\n<blockquote id=\"blockquote_26\">(i) the sexual penetration, however slight :\n</blockquote>   \n\n<blockquote id=\"blockquote_27\">(a) of the vagina or anus of the victim by the penis of the perpetrator or any other object used by the perpetrator; or\n \n\n</blockquote><blockquote id=\"blockquote_28\">(b) of a mouth of the victim by the penis of the perpetrator; \n</blockquote> \n\n<blockquote id=\"blockquote_29\">(ii) by coercion or force or threat of force against the victim or a third person.&quot;  \n</blockquote> \n\n<p data-structure=\"Precedent\" id=\"p_24\">In the second judgment of the Trial Chamber dated 22nd  February, 2001, the interpretation which focussed on serious violations of a sexual autonomy was accepted.\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_25\"><span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"551554\" id=\"span_4\"><span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"1031794\" id=\"span_5\">15. Shri R.N. Trivedi, learned Additional Solicitor General appearing for the respondents, has submitted that International Treaties ratified by India can be taken into account for framing guidelines in respect of enforcement of fundamental rights but only in absence of municipal laws as held in <a href=\"/doc/1031794/\" id=\"a_87\">Vishaka v. State of Rajasthan</a>  and <a href=\"/doc/551554/\" id=\"a_88\">Lakshmi Kant Pandey v. Union of India</a> . When laws are already existing, subsequent ratification of International Treaties would not render existing municipal laws ultra vires of Treaties in case of inconsistency. In such an event the State through its legislative wing can modify the law to bring it in accord with Treaty obligations. Such matters are in the realm of State policy and are, therefore, not enforceable in a Court of law. He has further submitted that in International law, ratified Treaties can be deemed interpreted in customary law unless the former are inconsistent with the domestic laws or decisions of its judicial Tribunals. The decision of the International Tribunal for the Crimes committed in the Territory of the Former Yugoslavia cannot be used for interpretation of <a href=\"/doc/203036/\" id=\"a_89\">Section 354</a> and <a href=\"/doc/623254/\" id=\"a_90\">375</a> IPC and other provisions. Even decisions of International Court of Justice are binding only on the parties to a dispute or intervenors in view of <a href=\"/doc/504161/\" id=\"a_91\">Articles 92</a><a href=\"/doc/986229/\" id=\"a_92\">, 93</a> and <a href=\"/doc/1070732/\" id=\"a_93\">94</a> of the UN Charter and <a href=\"/doc/858095/\" id=\"a_94\">Articles 59</a> and <a href=\"/doc/694525/\" id=\"a_95\">63</a> of the IJC Statutes. Learned counsel has also submitted that no writ of mandamus can be issued to the Parliament to amend any law or to bring it in accord with Treaty obligations. He has also submitted that <a href=\"/doc/203036/\" id=\"a_96\">Sections 354</a> and <a href=\"/doc/623254/\" id=\"a_97\">375</a> IPC have been interpreted in innumerable decisions of various High Courts and also of the Supreme Court and the consistent view is that to hold a person guilty of rape, penile penetration is essential. The law on the point is similar both in England and USA.</span></span> <span class=\"citetext\" data-sentiment=\"PARTY\" data-docid=\"960519\" id=\"span_6\">In <a href=\"/doc/960519/\" id=\"a_98\">State of Punjab v. Major Singh</a> 1966 (Supp) SCR 266 it was held that if the hymen is ruptured by inserting a finger, it would not amount to rape. Lastly, it has been submitted that a writ petition under <a href=\"/doc/981147/\" id=\"a_99\">Article 32</a> of the Constitution would not lie for reversing earlier decisions of the. Court on the supposed ground that a restrictive interpretation has been given to certain provisions of a Statute.</span>\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_26\">16. In support of his submission Shri Trivedi has placed reliance on Volume 11(1) of Halsbury&#x27;s Laws of England para 514 (Butterworths --1990) wherein unlawful sexual intercourse with woman without her consent has been held to be an essential ingredient of rape. Reference has also been made to Volume 75 Corpus Juris Secundum para 10, wherein it is stated that sexual penetration of a female is a necessary element of the crime of rape, but the slightest penetration of the body of the female by the sexual organ of the male is sufficient. Learned counsel has also referred to Principles Of Public International Law by Ian Brownlie, where the learned author, after referring to some decisions of English Courts has expressed an opinion that the clear words of a Statute bind the Court even if the provisions are contrary to international law and that there is no such thing as a standard of international law extraneous to the domestic law by a Kingdom and that international law as such can confer no rights cognizable in the municipal courts. Learned counsel has also referred to Dicey and Morris on The Conflict of Laws wherein in the Chapter on the enforcement of foreign law, following Rule has been stated :\n</p><blockquote id=\"blockquote_30\"> &quot;English Courts will not enforce or recognise a right, power, capacity, disability or legal relationship arising under the law of a foreign country, if the enforcement or recognition of such right, power, capacity, disability or legal relationship would be inconsistent with the fundamental public policy of English law.&quot;\n</blockquote> \n\n<p data-structure=\"Section\" id=\"p_27\">With regard to penal law, it has been stated as under :\n</p><blockquote id=\"blockquote_31\"> &quot;The common law considers crimes as altogether local, and congnisable and punishable exclusively in the country where they are committed.... Chief Justice Marshall, in delivering the opinion of the Supreme Court, said : &#x27;The Courts of no country execute the penal laws of another&#x27;.&quot;\n</blockquote> \n\n<p data-structure=\"Section\" id=\"p_28\">17. This Court on 13.1.1998 referred the matter to the Law Commission of India for its opinion on the main issue raised by the petitioner, namely, whether all forms of penetration would come within the ambit of <a href=\"/doc/623254/\" id=\"a_100\">Section 375</a> IPC or whether any change in statutory provisions need to be made, and if so, in what respect ? The Law Commission had considered some of the matters in its 156th Report and the relevant extracts of the recommendation made by it in the said Report, concerning the issue involved, were placed before the Court. Para 9.59 of the Report reads as under :\n</p><blockquote id=\"blockquote_32\"> &quot;9.59 Sexual-child abuse may be committed in various forms such as sexual intercourse, carnal intercourse and sexual assaults. The cases involving penile penetration into vagina are covered under <a href=\"/doc/623254/\" id=\"a_101\">Section 375</a> of the IPC. If there is any case of penile oral penetration and penile penetration into anus, <a href=\"/doc/1836974/\" id=\"a_102\">Section 377</a> IPC dealing with unnatural offences, i.e., carnal intercourse against the order of nature with any man, woman or animal, adequately takes care of them. If acts such as penetration of finger or any inanimate object into vagina or anus are committed against a woman or a female child, the provisions of the proposed <a href=\"/doc/203036/\" id=\"a_103\">Section 354</a> IPC whereunder a more severe punishment is also prescribed can be invoked and as regards the male child, the penal provisions of the <a href=\"/doc/1569253/\" id=\"a_104\">IPC</a> concerning &#x27;hurt&#x27;, &#x27;criminal force&#x27; or &#x27;assault&#x27; as the case may be, would be attracted. A distinction has to be naturally maintained between sexual assault/use of criminal force falling under Section 354, sexual offences falling under Section 375 and unnatural offences falling under <a href=\"/doc/1836974/\" id=\"a_105\">Section 377</a> of the Indian Penal Code. It may not be appropriate to bring unnatural offences punishable under <a href=\"/doc/1836974/\" id=\"a_106\">Section 377</a> IPC or mere sexual assault or mere sexual use of criminal force which may attract <a href=\"/doc/203036/\" id=\"a_107\">Section 354</a> IPC within the ambit of &#x27;rape&#x27; which is a distinct and graver offence with a definite connotation. It is needless to mention that any attempt to commit any of these offences is also punishable by virtue of <a href=\"/doc/1185693/\" id=\"a_108\">Section 511</a> IPC. Therefore, any other or more changes regarding this law may not be necessary.&quot;\n</blockquote> \n\n<p data-structure=\"Facts\" id=\"p_29\">Regarding <a href=\"/doc/1836974/\" id=\"a_109\">Section 377</a> IPC, the Law Commission recommended that in view of the ongoing instances of sexual abuse in the country where unnatural offences is committed on a person under age of eighteen years, there should be a minimum mandatory sentence of imprisonment for a term not less than two years but may extend to seven years and fine, with a proviso that for adequate and special reasons to be recorded in the judgment, a sentence of less than two years may be imposed. The petitioner submitted the response on the recommendations of the Law Commission. On 10/18.2.2000, this Court again requested the Law Commission to consider the comments of representative organisations (viz. SAKSHI, IFSHA and AIDWA).\n</p> \n\n<p data-structure=\"Section\" id=\"p_30\">18. The main question which requires consideration is whether by a process of judicial interpretation the provisions of <a href=\"/doc/623254/\" id=\"a_110\">Section 375</a> IPC can be so altered so as to include all forms of penetration such as penile/vaginal penetration, penile/oral penetration, penile/anal penetration, finger/vagina and finger/anal penetration and object/vaginal penetration within its ambit. Section 375 uses the expression &quot;sexual intercourse&quot; but the said expression has not been defined. The dictionary meaning of the word &quot;sexual intercourse&quot; is hetrosexual intercourse involving penetration of the vagina by the penis. The <a href=\"/doc/1569253/\" id=\"a_111\">Indian Penal Code</a> was drafted by the First Indian Law Commission of which Lord Mecaulay was the President. It was presented to the Legislative Council in 1856 and was passed on October 6, 1860. The Penal Code has undergone very few changes in the last more than 140 years. Except for clause sixthly of Section 375 regarding the age of the woman (which in view of Section 10 denotes a female human being of any age) no major amendment has been made in the said provision. Sub-section (2) of Section 376 and Sections 376A to 376D were inserted by <a href=\"/doc/1732853/\" id=\"a_112\">Criminal Law (Amendment) Act, 1983</a> but Sub-section (2) of Section 376 merely deals with special types of situations and provides for a minimum sentence of 10 years. It does not in any manner alter the definition of &#x27;rape&#x27; as given in <a href=\"/doc/623254/\" id=\"a_113\">Section 375</a> IPC. Similarly, Section 354 which deals with assault or criminal force to woman with intent to outrage her modesty and Section 377 which deals with unnatural offences have not undergone any major amendment.\n</p> \n\n<p data-structure=\"Section\" id=\"p_31\">19. It is well settled principle that the intention of the Legislature is primarily to be gathered from the language used, which means that attention should be paid to what has been said as also to what has not been said. As a consequence a construction which requires for its support addition or substitution of words or which results in rejection of words as meaningless has to be avoided. It is contrary to all rules of construction to read words into an Act unless it is absolutely necessary to do so. Similarly it is wrong and dangerous to proceed by substituting some other words for words of the statute. It is equally well settled that a statute enacting an offence or imposing a penalty is strictly construed. The fact that an enactment is a penal provision is in itself a reason for hesitating before ascribing to phrases used in it a meaning broader than that they would ordinarily bear. (Principles of Statutory Interpretation by Justice G.P. Singh p.58 and 751 Ninth Edition).\n</p> \n\n<p data-structure=\"Section\" id=\"p_32\">20. <a href=\"/doc/203036/\" id=\"a_114\">Sections 354</a>, <a href=\"/doc/623254/\" id=\"a_115\">375</a> and <a href=\"/doc/1836974/\" id=\"a_116\">377</a> IPC have come up for consideration before the superior courts of the country on innumerable occasions in a period of almost one and a half century. Only sexual intercourse, namely, hetrosexual intercourse involving penetration of the vagina by the penis coupled with the explanation that penetration is sufficient to constitute the sexual intercourse necessary for the offence of rape has been held to come within the purview of <a href=\"/doc/623254/\" id=\"a_117\">Section 375</a> IPC. The wide definition which the petitioner wants to be given to &quot;rape&quot; as defined in <a href=\"/doc/623254/\" id=\"a_118\">Section 375</a> IPC so that the same may become an offence punishable under <a href=\"/doc/1279834/\" id=\"a_119\">Section 376</a> IPC has neither been considered nor accepted by any Court in India so far. Prosecution of an accused for an offence under <a href=\"/doc/1279834/\" id=\"a_120\">Section 376</a> IPC on radically enlarged meaning of <a href=\"/doc/623254/\" id=\"a_121\">Section 375</a> IPC as suggested by the petitioner may violate the guarantee enshrined in <a href=\"/doc/1501707/\" id=\"a_122\">Article 20(1)</a> of the Constitution which says that no person shall be convicted of any offence except for violation of a law in force at the time of the commission of the act charged as an offence, nor be subjected to a penalty greater than that which might have been inflicted under the law in force at the time of the commission of the offence.\n</p> \n\n<p data-structure=\"CDiscource\" id=\"p_33\"><span class=\"citetext\" data-sentiment=\"Neg\" data-docid=\"1353689\" id=\"span_7\">21. The decision of Constitutional Court of South Africa cited by learned counsel for the petitioner does not commend to us as the Court there treated &quot;Gays and Lesbian in permanent same sex life partnerships&quot; at par with &quot;spouses&quot; and took upon itself the task of Parliament in holding that in Section 25(5) of the Aliens Control Act, after the word &quot;spouse&quot;, the words &quot;or partner in a permanent same sex life partnership&quot; should be read. The decision of House of Lords in <a href=\"/doc/1353689/\" id=\"a_123\">R. v. R.</a> was given on its own facts which deserve notice. Here the wife had left her matrimonial home with her son on 21st October, 1989 and went to live with her parents. She had consulted solicitors about matrimonial problems and had left a letter for the husband informing him that she intended to petition for divorce. On 23rd  October, 1989 the husband spoke to his wife on telephone indicating that it was his intention also to seek divorce. In the night of 12th November, 1989 the husband forced his way into the house of his wife&#x27;s parents, who were out at that time and attempted to have sexual intercourse with her against her will. In the course of doing so he assaulted her by squeezing her neck with both hands. On the facts of the case the conviction of the husband may not be illegal. It is very doubtful whether the principle laid down can be of universal application.</span> In Regina v. Burstow psychiatric injury was held to be bodily harm under Section 20, having regard to the meaning of the word in the usage of the present day. In our opinion the judgment of the International Tribunal can have no application here as Tribunal itself noted that no definition of rape can be found in International law and it was dealing with prosecution of persons responsible for serious violations of International Humanitarian Law committed in the Territory of former Yugoslavia. The judgment is not at all concerned with interpretation of any provision of domestic law in peace time conditions. The decisions cited by the learned counsel for the petitioner, therefore, do not persuade us to enlarge the definition of rape as given in <a href=\"/doc/623254/\" id=\"a_124\">Section 375</a> IPC which has been consistently so understood for over a century through out the country.\n</p> \n\n<p data-structure=\"Section\" id=\"p_34\">22. It may be noted that ours is a vast and big country of over 100 crore people. Normally, the first reaction of a victim of crime is to report the incident at the police station and it is the police personnel who register a case under the appropriate Sections of the Penal Code. Such police personnel are invariably not highly educated people but they have studied the basic provisions of the <a href=\"/doc/1569253/\" id=\"a_125\">Indian Penal Code</a> and after registering the case under the appropriate sections, further action is taken by them as provided in <a href=\"/doc/445276/\" id=\"a_126\">Code of Criminal Procedure</a>. <a href=\"/doc/1569253/\" id=\"a_127\">Indian Penal Code</a> is a part of the curriculum in the law degree and it is the existing definition of &quot;rape&quot; as contained in <a href=\"/doc/623254/\" id=\"a_128\">Section 375</a> IPC which is taught to every student of law. A criminal case is initially handled by a Magistrate and thereafter such cases as are exclusively triable by Court of Session are committed the Court of Session. The entire legal fraternity of India, lawyers or Judges, have the definition as contained in <a href=\"/doc/623254/\" id=\"a_129\">Section 375</a> IPC engrained in their mind and the cases are decided on the said basis. The first and foremost requirement in criminal law is that it should be absolutely certain and clear. An exercise to alter the definition of rape, as contained in <a href=\"/doc/623254/\" id=\"a_130\">Section 375</a> IPC, by a process of judicial interpretation, and that too when there is no ambiguity in the provisions of the enactment is bound to result in good deal of chaos and confusion, and will not be in the interest of society at large.\n</p> \n\n<p data-structure=\"CDiscource\" id=\"p_35\">23. Stare decisis is a well known doctrine in legal jurisprudence. The doctrine of stare decisis, meaning to stand by decided cases, rests upon the principle that law by which men are governed should be fixed, definite and known, and that, when the law is declared by court of competent jurisdiction authorised to construe if, such declaration, in absence of palpable mistake or error, is itself evidence of the law until changed by competent authority. It requires that rules of law when clearly announced and established by a Court of last resort should not be lightly disregarded and set aside but should be adhered to and followed. What it precludes is that where a principle of law has become established by a series of decisions, it is binding on the Courts and should be followed in similar cases. It is a wholesome doctrine which gives certainty to law and guides the people to mould their affairs in future.\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_36\">24. <span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"191199\" id=\"span_8\">In <a href=\"/doc/191199/\" id=\"a_131\">Mishri Lal v. Dhierendra Nath</a>  importance of this doctrine was emphasised for the purpose of avoiding uncertainty and confusion and paras 14, 15, 16 and 21 of the Reports read as under :</span>\n</p>  \n\n<blockquote id=\"blockquote_33\"> &quot;14. This Court in Muktul v. Manbhari  explained the scope of the doctrine of stare decisis with reference to Haralsbury&#x27;s Laws of England and Corpus Juris Secundum in the following manner:\n</blockquote>  \n\n<blockquote id=\"blockquote_34\"> &quot;The principle of stare decisis is thus stated in Halsbury&#x27;s Laws of England, 2nd  Edn.:\n</blockquote><blockquote id=\"blockquote_35\">  &#x27;Apart from any question as to the courts being of coordinate jurisdiction, a decision which has been followed for a long period of time, and has been acted upon by persons in the formation of contracts or in the disposition of their property, or in the general conduct of affairs, or in legal procedure or in other ways, will generally be followed by courts of higher authority than the court establishing the rule, even though the court before whom the matter arises afterwards might not have given the same decision had the question come before it originally. But the Supreme Appellate Court will not shrink from overruling a decision, or series of decisions, which establish a doctrine plainly outside the statute and outside the common law, when no title and no contract will be shaken, no persons can complain, and no general course of dealing be altered by the remedy of a mistake.&quot;\n</blockquote> \n\n<p data-structure=\"Precedent\" id=\"p_37\">The same doctrine is thus explained in Corpus Juris Secundum -\n</p><p data-structure=\"CDiscource\" id=\"p_38\">  &#x27;Under the stare decisis rule, a principle of law which has become settled by a series of decisions generally is binding on the courts and should be followed in similar cases. This rule is based on expediency and public policy, and, although generally it should be strictly adhered to by the courts, it is not universally applicable.&#x27;&quot;  \n</p> \n\n<blockquote id=\"blockquote_36\">15. Be it noted however that Corpus Juris Secundum adds a rider that\n &quot;previous decisions should not be followed to the extent that grievous wrong may result; and, accordingly, the courts ordinarily will not adhere to a rule of principle established by previous decisions which they are convinced is erroneous. The rule of stare decisis is not so imperative or inflexible as to preclude a departure therefrom in any case, but its application must be determined in each case by the discretion of the court, and previous decisions should not be followed to the extent that error may be perpetuated and grievous wrong may result.&quot;\n</blockquote> \n\n<p data-structure=\"CDiscource\" id=\"p_39\">16. The statement though deserves serious consideration in the event of a definite finding as to the perpetration of a grave wrong but that by itself does not denude me time-tested doctrine of stare decisis of its efficacy. Taking recourse to the doctrine would be an imperative necessity to avoid uncertainty and contusion. The basic feature of law is its certainty and in the event of there being uncertainty as regards the state of law - the society would be in utter confusion the resultant effect of which would bring about a situation of chaos - a situation which ought always to be avoided.\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_40\">21. In this context reference may also be made to two English decisions:\n</p>   \n\n<blockquote id=\"blockquote_37\">(a) in Admiralty Commrs. v. Valverda (Owners) 1938 AC 173 (AC at p. 194) wherein the House of Lords observed that even long established conveyancing practice, although not as authoritative as a judicial decision, will cause the House of Lords to hesitate before declaring it wrong, and\n \n\n</blockquote><blockquote id=\"blockquote_38\">(b) in Button v. Director of Public Prosecution 1966 AC 591 the House of Lords observed :\n</blockquote><blockquote id=\"blockquote_39\"> &quot;In Corpus Juris Secundum, a contemporary statement of American Law, the stare decisis rule has been stated to be a principle Of law which has become settled by a series of decisions generally, is binding on the courts and should be followed in similar cases. It has been stated that this rule is based on expediency and public policy and should be strictly adhered to by the courts. Under this rule courts are bound to follow the common law as it has been judicially declared in previously adjudicated cases and rules of substantive law should be reasonably interpreted and administered. This rule has to preserve the harmony and stability of the law and to make as steadfast as possible judicially declared principles affecting the rights of property, it being indispensable to the due administration of justice, especially by a court of last resort, that a question once deliberately examined and declared should be considered as settled and closed to further argument. It is a salutary rule, entitled to great weight and ordinarily should be strictly adhered to by the courts. The courts are slow to interfere with the principle announced by the decision, and it may be upheld even though they would decide otherwise were the question a new one, or equitable considerations might suggest, a different result and although it has been erroneously applied in a particular case. The rule represents an element of continuity in law and is rooted in the psychologic need to satisfy reasonable expectations, but it is a principle of policy and not a mechanical formula of adherence to the latest decision however recent and questionable when such adherence involves collision with a prior doctrine more embracing in its scope, intrinsically sounder and verified by experience.&quot;   \n</blockquote> \n\n<p data-structure=\"Precedent\" id=\"p_41\">25. It may be noticed that on July 26, 1966, the House of Lords made a departure from its past practice when a statement was made to the following effect:\n</p>  \n\n<blockquote id=\"blockquote_40\"> &quot;Their lordships regard the use of precedent as an indispensable foundation upon which to decide what is the law and its application to individual cases. It provides at least some degree of certainty upon which individuals can rely in the conduct of their affairs, as well as a basis for orderly development of legal rules.\n</blockquote> \n\n<blockquote id=\"blockquote_41\">Their lordships nevertheless recognise that too rigid adherence to precedent may lead to injustice in a particular case and also unduly restrict the proper development of the law. They propose therefore to modify their present practice and, while treating former decisions of this House as normally binding, to depart from a previous decision when it appears right to do so.\n</blockquote> \n\n<blockquote id=\"blockquote_42\">In this connection they will boar in mind the danger of disturbing retrospectively the basis on which contracts, settlements of property and fiscal arrangements have been entered into and also the especial need for certainty as to the criminal law.\n</blockquote> \n\n<blockquote id=\"blockquote_43\">This announcement is not intended to affect the use of precedent elsewhere than in this House.&quot; \n</blockquote> \n\n<p data-structure=\"CDiscource\" id=\"p_42\">26. While making the above statement a rule of caution was sounded that while departing from a previous decision when it appears right to do so, the especial need for certainty as to criminal law shall be borne in mind. There is absolutely no doubt or confusion regarding the interpretation of provisions of <a href=\"/doc/623254/\" id=\"a_132\">Section 375</a> IPC and the law is very well settled. The inquiry before the Courts relate only to the factual aspect of the matter which depends upon the evidence available on the record and not on the legal aspect. Accepting the contention of the writ petitioner and giving a wider meaning to <a href=\"/doc/623254/\" id=\"a_133\">Section 375</a> IPC will lead to a serious confusion in the minds of prosecuting agency and the Courts which instead of achieving the object of expeditiously bringing a criminal to book may unnecessarily prolong the legal proceedings and would have an adverse impact on the society as a whole. We are, therefore, of the opinion that it will not be in the larger interest of the State or the people to alter the definition of &quot;rape&quot; as contained in <a href=\"/doc/623254/\" id=\"a_134\">Section 375</a> IPC by a process of judicial interpretation as is sought to be done by means of the present writ petition.\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_43\">27. The other aspect which has been highlighted and needs consideration relates to providing protection to a victim of sexual abuse at the time of recording his statement in court. The main suggestions made by the petitioner are for incorporating special provisions in child sexual abuse cases to the following effect:  \n</p>  \n\n<blockquote id=\"blockquote_44\"> (i) permitting use of a videotaped interview of the child&#x27;s statement by the judge (in the presence of a child support person), \n \n\n</blockquote><blockquote id=\"blockquote_45\">  (ii) allow a child to testify via closed circuit television or from behind a screen to obtain a full and candid account of the acts complained of.\n</blockquote> \n\n<blockquote id=\"blockquote_46\">(iii) The cross examination of a minor should only be carried out by the judge based on written questions submitted by the defense upon perusal of the testimony of the minor\n \n\n</blockquote><blockquote id=\"blockquote_47\">(iv) Whenever a child is required to give testimony, sufficient breaks should be given as and when required by the child. \n</blockquote> \n\n<p data-structure=\"Precedent\" id=\"p_44\">28. The Law Commission, in its response, did not accept the said request in view of <a href=\"/doc/1151812/\" id=\"a_135\">Section 273</a> Cr.P.C. as in its opinion the principle of the said Section which is founded upon natural justice, cannot be done away in trials and inquiries concerning sexual offences. The Commission, however, observed that in an appropriate case it may be open to the prosecution to request the Court to provide a screen in such a manner that the victim does not see the accused while at the same time provide an opportunity to the accused to listen to the testimony of the victim and give appropriate instructions to his counsel for an effective cross-examination. The Law Commission suggested that with a view to allay any apprehensions on this score, a proviso can be placed above the Explanation to <a href=\"/doc/1151812/\" id=\"a_136\">Section 273</a> of the Criminal Procedure Code to the following effect: &quot;Provided that where the evidence of a person below sixteen years who is alleged to have been subjected to sexual assault or any other sexual offence, is to be recorded, the Court may, take appropriate measures to ensure that such person is not confronted by the accused while at the same time ensuring the right of cross-examination of the accused.&quot;.\n</p> \n\n<p data-structure=\"CDiscource\" id=\"p_45\">29. Ms. Meenakshi Arora has referred to a decision of the Canadian Supreme Court in Her Majesty The Queen, Appellant v. D.O.L., Respondent and the Attorney General of Canada, etc. (1993) 4 SCR 419, wherein the constitutional validity of Section 715.1 of the Criminal Code was examined. This section provides that in any proceeding relating to certain sexual offences in which the complainant was under age of eighteen years at the time the offence is alleged to have been committed, a videotape made within a reasonable time after the alleged offence in which the complainant describes the act complained of, is admissible in evidence, if the complainant while testifying adopts the contents of the videotape. The Court of Appeal had declared Section 715.1 unconstitutional on the ground that the same contravened <a href=\"/doc/1194614/\" id=\"a_137\">Sections 7</a> and 11(d) of the Canadian Charter of Rights and Freedoms and could not be sustained under <a href=\"/doc/1683849/\" id=\"a_138\">Section 1</a>. The Supreme Court took note of some glaring features in such type of cases viz. the innate power imbalance which exists between abuser and the abused child; a failure to recognise that the occurrence of child sexual abuse is one intertwined with the sexual abuse of all women, regardless of age; and that the Court cannot disregard the propensity of victims of sexual abuse to fail to report the abuse in order to conceal their plight from institutions without the criminal justice system which hold stereotypical and biased views about the victimisation of women. The Court accordingly held that the procedures set out in Section 715.1 are designed to diminish the stress and trauma suffered by child complainants as a byproduct of their role in the criminal justice system. The &quot;system induced trauma&quot; often ultimately serves to re-victimise the young complainant. The Section was intended to preserve the evidence of the child and to remove the need for them to repeat their story many times. It is often repetition of the story that results in the infliction of trauma and stress upon a child who is made to believe that she is not being believed and that her experiences are not validated. The benefits such a provision would have in limiting the strain imposed on child witness who arc required to provide detailed testimony about confusing, embarrassing and frightful incidents of abuse in an intimidating, confrontational and often hostile court room atmosphere. Another advantage afforded by the Section is the opportunity for the child to answer delicate questions about the abuse in a more controlled, less stressful and less hostile environment, a factor which according to social science research, may drastically increase the likelihood of eliciting the truth about the events at hand. The videotape testimony enables the Court to hear a more accurate account of what the child was saying about the incident at the time it first came to light and the videotape of an early interview if used in evidence can supplement the evidence of a child who is inarticulate or forgetful at the trial. The Section also acts to remove the pressure placed on a child victim of sexual assault when the attainment of &quot;truth&quot; depends entirely on her ability to control her fear, her shame and the horror of being face to face with the accused when she must describe her abuse in a compelling and coherent manner. The Court also observed that the rules of evidence have not been constitutionalised into unaltered principles of fundamental justice. Neither should they be interpreted in a restrictive manner which may essentially defeat their purpose of seeking truth and justice. Rules of evidence, as much as the law itself, are not cast in stone and will evolve with time. The Court accordingly reversed the judgment of Court of Appeal and upheld the constitutionality of Section 715.1.\n</p> \n\n<p data-structure=\"Section\" id=\"p_46\">30. We will briefly refer to the statutory provisions governing the situation. <a href=\"/doc/1151812/\" id=\"a_139\">Section 273</a> Cr.P.C. lays down that except as otherwise expressly provided, all evidence taken in the course of the trial or other proceedings shall be taken in the presence of the accused, or when his personal attendance is dispensed with, in the presence of his pleader. Sub-section (1) of <a href=\"/doc/1134316/\" id=\"a_140\">Section 327</a> Cr.P.C. lays down that any Criminal Court enquiring into or trying any offence shall be deemed to be open Court to which the public generally may have access, so, far as the same can conveniently contain them. Sub-section (2) of the same Sections says that notwithstanding anything contained in Sub-section (1) the inquiry into the trial of rape or an offence under Section 376, Section 376A, Section 376B, Section 376C or <a href=\"/doc/9545/\" id=\"a_141\">Section 376D</a> of the Indian Penal Code shall be conducted in camera. Under the proviso to this sub-section the Presiding Judge may, if he thinks fit, or on an application made by either of the parties, allow any particular person to have access to, or be or remain in, the room or building used by the court. It is rather surprising that the legislature while incorporating Sub-section (2) to Section 327 by amending Act 43 of 1983 failed to take note of offences under <a href=\"/doc/203036/\" id=\"a_142\">Section 354</a> and <a href=\"/doc/1836974/\" id=\"a_143\">377</a> IPC and omitted to mention the aforesaid provisions. Deposition of the victims of offences under <a href=\"/doc/203036/\" id=\"a_144\">Section 354</a> and <a href=\"/doc/1836974/\" id=\"a_145\">377</a> IPC can at times be very embarrassing to them.\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_47\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"560467\" id=\"span_9\">31. The whole inquiry before a Court being to elicit the truth, it is absolutely necessary that the victim or the witnesses are able to depose about the entire incident in a free atmosphere without any embarrassment. <a href=\"/doc/1151812/\" id=\"a_146\">Section 273</a> Cr.P.C. merely requires the evidence to be taken in the presence of the accused. The Section, however, does not say that the evidence should be recorded in such a manner that the accused should have full view of the victim or the witnesses. Recording of evidence by way of video conferencing vis-a-vis <a href=\"/doc/1151812/\" id=\"a_147\">Section 273</a> Cr.P.C. has been held to be permissible in a recent decision of this Court in <a href=\"/doc/560467/\" id=\"a_148\">State of Maharashtra v. Dr. Praful B Desai</a> . There is major difference between substantive provisions defining crimes and providing punishment for the same and procedural enactment laying down the procedure of trial of such offences. Rules of procedure are hand-maiden of justice and are meant to advance and not to obstruct the cause of justice. It is, therefore, permissible for the Court to expand or enlarge the meanings of such provisions in order to elicit the truth and do justice with the parties.</span>\n</p> \n\n<p data-structure=\"Section\" id=\"p_48\">32. The mere sight of the accused may induce an element of extreme fear in the mind of the victim or the witnesses or can put them in a state of shock. In such a situation he or she may not be able to give full details of the incident which may result in miscarriage of justice. Therefore, a screen or some such arrangement can be made where the victim or witnesses do not have to undergo the trauma of seeing the body or the face of the accused. Often the questions put in cross-examination are purposely designed to embarrass or confuse the victims of rape and child abuse. The object is that out of the feeling of shame or embarrassment, the victim may not speak out or give details of certain acts committed by the accused. It will, therefore, be better if the questions to be put by the accused in cross-examination are given in writing to the Presiding Officer of the Court, who may put the same to the victim or witnesses in a language which is not embarrassing. There can hardly be any objection to the other suggestion given by the petitioner that whenever a child or victim of rape is required to give testimony, sufficient breaks should be given as and when required. The provisions of Sub-section (2) of <a href=\"/doc/1134316/\" id=\"a_149\">Section 327</a> Cr.P.C. should also apply in inquiry or trial of offences under <a href=\"/doc/203036/\" id=\"a_150\">Section 354</a> and <a href=\"/doc/1836974/\" id=\"a_151\">377</a> IPC.\n</p> \n\n<p data-structure=\"Precedent\" id=\"p_49\">33. <span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1046545\" id=\"span_10\">In <a href=\"/doc/1046545/\" id=\"a_152\">State of Punjab v. Gurmit Singh</a>  this Court had highlighted the importance of provisions of Section 327(2) and (3) <a href=\"/doc/445276/\" id=\"a_153\">Cr.P.C</a>. and a direction was issued not to ignore the mandate of the aforesaid provisions and to hold the trial of rape cases in camera. It was also pointed out that such a trial in camera would enable the victim of crime to be a little comfortable and answer the questions with greater ease and thereby improve the quality of evidence of a prosecutrix because there she would not be so hesitant or bashful to depose frankly as she may be in an open court, under the gaze of the public. It was further directed that as far as possible trial of such cases may be conducted by lady Judges wherever available so that the prosecutrix can make a statement with greater ease and assist the court to properly discharge their duties, without allowing the truth to be sacrificed at the altar of rigid technicalities.</span>\n</p> \n\n<p data-structure=\"Conclusion\" id=\"p_50\">34. The writ petition is accordingly disposed of with the following directions:\n</p>   \n\n<blockquote id=\"blockquote_48\">(1) The provisions of Sub-section (2) of <a href=\"/doc/1134316/\" id=\"a_154\">Section 327</a> Cr.P.C. shall, in addition to the offences mentioned in the sub-section, would also apply in inquiry or trial of offences under <a href=\"/doc/203036/\" id=\"a_155\">Sections 354</a> and <a href=\"/doc/1836974/\" id=\"a_156\">377</a> IPC.\n</blockquote> \n\n<blockquote id=\"blockquote_49\">(2) In holding trial of child sex abuse or rape:\n</blockquote>   \n\n<blockquote id=\"blockquote_50\">(i) a screen or some such arrangements may be made where the victim or witnesses (who may be equally vulnerable like the victim) do not see the body or face of the accused; \n</blockquote> \n\n<blockquote id=\"blockquote_51\">  (ii) the questions put in cross-examination on behalf of the accused, in so far as they relate directly to the incident should be given in writing to the Presiding Officer of the Court who may put them to the victim or witnesses in a language which is clear and is not embarrassing;\n</blockquote> \n\n<blockquote id=\"blockquote_52\">(iii) the victim of child abuse or rape, while giving testimony in court, should be allowed sufficient breaks as and when required. \n</blockquote> \n\n<p data-structure=\"Conclusion\" id=\"p_51\"><span class=\"citetext\" data-sentiment=\"Pos\" data-docid=\"1046545\" id=\"span_11\">These directions are in addition to those given in <a href=\"/doc/1046545/\" id=\"a_157\">State of Punjab v. Gurmit Singh</a>.</span> \n</p> \n\n<p data-structure=\"Conclusion\" id=\"p_52\">35. The suggestions made by the petitioners will advance the cause of justice and are in the larger interest of society. The cases of child abuse and rape are increasing at alarming speed and appropriate legislation in this regard is, therefore, urgently required. We hope and trust that the Parliament will give serious attention to the points highlighted by the petitioner and make appropriate legislation with all the promptness which it deserves.\n</p> \n\n<p data-structure=\"Conclusion\" id=\"p_53\">36. Before parting with the case, we must place it on record that Ms. Meenakshi Arora put in lot of efforts and hard labour in placing the relevant material before the Court and argued the matter with commendable ability.\n</p> \n\n<p data-structure=\"Conclusion\" id=\"p_54\"> G.P. Mathur, J.  \n</p> \n\n<p data-structure=\"Conclusion\" id=\"p_55\">37. For the reasons given in WP(Crl.) No. 33 of 1997 decided today, Special Leave Petitions are dismissed.\n</p>\n\n\n \n\n","numcites":47,"numcitedby":69,"docsource":"Supreme Court of India","citetid":96356448,"divtype":"judgments","relatedqs":[{"value":"section 377 of ipc","formInput":"section%20377%20of%20ipc"},{"value":"ipc sec 354","formInput":"ipc%20sec%20354"},{"value":"unnatural offences","formInput":"unnatural%20offences"},{"value":"child sexual abuse","formInput":"child%20sexual%20abuse"},{"value":"\"homosexual\"","formInput":"%22homosexual%22"},{"value":"rape ","formInput":"rape%20"},{"value":"section 377 of indian penal code","formInput":"section%20377%20of%20indian%20penal%20code"},{"value":"Section 273 crpc","formInput":"Section%20273%20crpc"},{"value":"section.377 ipc and section 354 ipc","formInput":"section.377%20ipc%20and%20section%20354%20ipc"},{"value":"carnal intercourse","formInput":"carnal%20intercourse"},{"value":"Finger in vagina  filter:  section 354","formInput":"Finger%20in%20vagina%20%20filter%3A%20%20section%20354"},{"value":"intercourse sexual","formInput":"intercourse%20sexual"},{"value":"section 375 ipc","formInput":"section%20375%20ipc"},{"value":"section 376 ipc","formInput":"section%20376%20ipc"},{"value":"indian penal code section 354","formInput":"indian%20penal%20code%20section%20354"},{"value":"section- 327 of code of criminal procedure ","formInput":"section-%20327%20of%20code%20of%20criminal%20procedure%20"},{"value":"child  abuse","formInput":"child%20%20abuse"},{"value":"section 273 criminal procedure code","formInput":"section%20273%20criminal%20procedure%20code"},{"value":"Finger in vagina  filter:  section 377 of ipc","formInput":"Finger%20in%20vagina%20%20filter%3A%20%20section%20377%20of%20ipc"},{"value":"stare decisis","formInput":"stare%20decisis"}],"cats":[{"value":"rape","formInput":"tag:rape"},{"value":"unnatural-offences","formInput":"tag:unnatural-offences"},{"value":"assault-on-woman","formInput":"tag:assault-on-woman"},{"value":"indian-penal-code","formInput":"tag:indian-penal-code"}],"courtcopy":false,"cites":[{"tid":623254,"title":"Section 375 in The Indian Penal Code, 1860"},{"tid":1836974,"title":"Section 377 in The Indian Penal Code, 1860"}],"citedby":[{"tid":154510573,"title":"Pradip Patra @ Prodip Patra @ Basu vs State Of West Bengal on 2 December, 2022"},{"tid":189029849,"title":"Debashish Ghosh vs M/O Railways on 7 December, 2023"},{"tid":27841840,"title":"Rafiq Qureshi vs Narcotic Control Bureau Eastern Zonal ... on 7 May, 2019"}],"query_alert":null,"agreement":false}