{"tid":84549554,"publishdate":"2024-07-01","title":"Section 2 in Bharatiya Sakshya Adhiniyam, 2023","doc":"<h2 class=\"doc_title\">Section 2 in Bharatiya Sakshya Adhiniyam, 2023</h2>\n\n<section class=\"akn-section\" id=\"section_2\"><h3>2. Definitions </h3>\n<section class=\"akn-subsection\" id=\"section_2.1\"><span class=\"akn-num\"><a href=\"/doc/33479536/\">(1)</a></span><span class=\"akn-intro\"><span class=\"akn-p\">In this Adhiniyam, unless the context otherwise requires,</span></span><section class=\"akn-paragraph\" id=\"section_2.1.a\"><span class=\"akn-num\"><a href=\"/doc/43453629/\">(a)</a></span><span class=\"akn-content\"><span class=\"akn-p\">\"Court\" includes all Judges and Magistrates, and all persons, except arbitrators, legally authorised to take evidence;</span></span></section><section class=\"akn-paragraph\" id=\"section_2.1.b\"><span class=\"akn-num\"><a href=\"/doc/188842965/\">(b)</a></span><span class=\"akn-content\"><span class=\"akn-p\">\"conclusive proof\" means when one fact is declared by this Adhiniyam to be conclusive proof of another, the Court shall, on proof of the one fact, regard the other as proved, and shall not allow evidence to be given for the purpose of disproving it;</span></span></section><section class=\"akn-paragraph\" id=\"section_2.1.c\"><span class=\"akn-num\"><a href=\"/doc/70478832/\">(c)</a></span><span class=\"akn-content\"><span class=\"akn-p\">\"disproved\" in relation to a fact, means when, after considering the matters before it, the Court either believes that it does not exist, or considers its non-existence so probable that a prudent man ought, under the circumstances of the particular case, to act upon the supposition that it does not exist;</span></span></section><section class=\"akn-paragraph\" id=\"section_2.1.d\"><span class=\"akn-num\"><a href=\"/doc/141813873/\">(d)</a></span><span class=\"akn-content\"><span class=\"akn-p\">\"document\" means any matter expressed or described or otherwise recorded upon any substance by means of letters, figures or marks or any other means or by more than one of those means, intended to be used, or which may be used, for the purpose of recording that matter and includes electronic and digital records.</span><span class=\"akn-p\"><span class=\"akn-remark\" data-status=\"editorial\">[<b class=\"akn-b\">Similar to Section 3 from Old IEA</b>-<a class=\"akn-ref\" data-eid=\"part_I__chp_IPreliminary__sec_2-Definitions__subsec_1__para_d__p_2__ref_1\" data-href=\"https://indiankanoon.org/doc/1031309/\" href=\"https://indiankanoon.org/doc/1031309/\" id=\"part_I__chp_IPreliminary__sec_2-Definitions__subsec_1__para_d__p_2__ref_1\">Also Refer</a>]</span></span><span class=\"akn-p\"><i class=\"akn-i\">Illustrations.</i></span><span class=\"akn-p\">(i) A writing is a document.</span><span class=\"akn-p\">(ii) Words printed, lithographed or photographed are documents.</span><span class=\"akn-p\">(iii) A map or plan is a document.</span><span class=\"akn-p\">(iv) An inscription on a metal plate or stone is a document.</span><span class=\"akn-p\">(v) A caricature is a document.</span><span class=\"akn-p\">(vi) An electronic record on emails, server logs, documents on computers, laptop or smartphone, messages, websites, locational evidence and voice mail messages stored on digital devices are documents;</span></span></section><section class=\"akn-paragraph\" id=\"section_2.1.e\"><span class=\"akn-num\"><a href=\"/doc/151341305/\">(e)</a></span><span class=\"akn-content\"><span class=\"akn-p\">\"evidence\" means and includes-</span><span class=\"akn-p\">(i) all statements including statements given electronically which the Court permits or requires to be made before it by witnesses in relation to matters of fact under inquiry and such statements are called oral evidence;</span><span class=\"akn-p\">(ii) all documents including electronic or digital records produced for the inspection of the Court and such documents are called documentary evidence;</span></span></section><section class=\"akn-paragraph\" id=\"section_2.1.f\"><span class=\"akn-num\"><a href=\"/doc/37246054/\">(f)</a></span><span class=\"akn-content\"><span class=\"akn-p\">\"fact\" means and includes-</span><span class=\"akn-p\">(i) any thing, state of things, or relation of things, capable of being perceived by the senses;</span><span class=\"akn-p\">(ii) any mental condition of which any person is conscious.</span><span class=\"akn-p\"><i class=\"akn-i\">Illustrations.</i></span><span class=\"akn-p\">(i) That there are certain objects arranged in a certain order in a certain place, is a fact.</span><span class=\"akn-p\">(ii) That a person heard or saw something, is a fact.</span><span class=\"akn-p\">(iii) That a person said certain words, is a fact.</span><span class=\"akn-p\">(iv) That a person holds a certain opinion, has a certain intention, acts in good faith, or fraudulently, or uses a particular word in a particular sense, or is or was at a specified time conscious of a particular sensation, is a fact;</span></span></section><section class=\"akn-paragraph\" id=\"section_2.1.g\"><span class=\"akn-num\"><a href=\"/doc/112077336/\">(g)</a></span><span class=\"akn-content\"><span class=\"akn-p\">\"facts in issue\" means and includes any fact from which, either by itself or in connection with other facts, the existence, non-existence, nature or extent of any right, liability or disability, asserted or denied in any suit or proceeding, necessarily follows.</span><span class=\"akn-p\"><i class=\"akn-i\">Explanation.</i> - Whenever, under the provisions of the law for the time being in force relating to civil procedure, any Court records an issue of fact, the fact to be asserted or denied in the answer to such issue is a fact in issue.</span><span class=\"akn-p\"><i class=\"akn-i\">Illustrations.</i> A is accused of the murder of B. At his trial, the following facts may be in issue:-</span><span class=\"akn-p\">(i) That A caused B's death.</span><span class=\"akn-p\">(ii) That A intended to cause B's death.</span><span class=\"akn-p\">(iii) That A had received grave and sudden provocation from B.</span><span class=\"akn-p\">(iv) That A, at the time of doing the act which caused B's death, was, by reason of unsoundness of mind, incapable of knowing its nature;</span></span></section><section class=\"akn-paragraph\" id=\"section_2.1.h\"><span class=\"akn-num\"><a href=\"/doc/112766561/\">(h) \"may presume\".</a></span><span class=\"akn-content\"><span class=\"akn-p\">Whenever it is provided by this Adhiniyam that the Court may presume a fact, it may either regard such fact as proved, unless and until it is disproved or may call for proof of it;</span><span class=\"akn-p\">(i) \"not proved\". - A fact is said to be not proved when it is neither proved nor disproved;</span><span class=\"akn-p\">(j) \"proved\". - A fact is said to be proved when, after considering the matters before it, the Court either believes it to exist, or considers its existence so probable that a prudent man ought, under the circumstances of the particular case, to act upon the supposition that it exists;</span><span class=\"akn-p\">(k) \"relevant\". - A fact is said to be relevant to another when it is connected with the other in any of the ways referred to in the provisions of this Adhiniyam relating to the relevancy of facts;</span><span class=\"akn-p\">(l) \"shall presume\". - Whenever it is directed by this Adhiniyam that the Court shall presume a fact, it shall regard such fact as proved, unless and until it is disproved.</span><span class=\"akn-p\">(2) Words and expressions used herein and not defined but defined in the Information Technology Act, 2000,(21 of 2000) the Bharatiya Nagarik Suraksha Sanhita, 2023 and the Bharatiya Nyaya Sanhita, 2023 shall have the same meanings as assigned to them in the said Act and Sanhitas.</span></span></section></section></section>","numcites":0,"numcitedby":0,"docid":84549554,"docsource":"Union of India - Section","covers":[{"tid":70224818,"title":"Entire Act"}],"citetid":89955729,"divtype":"akoma-ntoso","courtcopy":false,"cites":[],"citedby":[],"query_alert":null,"agreement":false}